ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/file_system_task.c
/**
***************************************************************************
* @addtogroup Tasks
* @{
* @file         file_system_task.c
* @author       ADI
* @version      V1.0.1
* @date         16-June-2020
* @brief        Source file contains file system access for
                wearable device framework.
***************************************************************************
* @attention
***************************************************************************
*/
/*!
*  \copyright Analog Devices
* ****************************************************************************
*
* License Agreement
*
* Copyright (c) 2020 Analog Devices Inc.
* All rights reserved.
*
* This source code is intended for the recipient only under the guidelines of
* the non-disclosure agreement with Analog Devices Inc.
*
* THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
* EXPRESS OR  IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
* IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY
* CLAIM, DAMAGES OR OTHER  LIABILITY, WHETHER IN AN ACTION OF CONTRACT,
* TORT OR OTHERWISE, ARISING  FROM, OUT OF OR IN CONNECTION WITH THE
* SOFTWARE OR THE USE OR OTHER  DEALINGS IN THE SOFTWARE.
* ****************************************************************************
*/

/* Includes -----------------------------------------------------------------*/
#ifdef USE_FS
#include <task_includes.h>
#include <includes.h>
#include <file_system_interface.h>
#include <led_interface.h>
//#include <clk.h>
#include "FreeRTOS.h"
#include "task.h"
#include "timers.h"
#include "hw_if_config.h"
#include "app_timer.h"
#include "power_manager.h"

#ifdef PROFILE_TIME_ENABLED
#include "us_tick.h"
#endif

#ifdef VSM_MBOARD
#include "watch_vsm_motherboard_pin_config.h"
#elif PCBA
#include "watch_board_pcba_pin_config.h"
#else
#include "watch_board_evt_pin_config.h"
#endif

#include <file_system_utils.h>
#include <file_system_task.h>
#include <system_interface.h>
#include <system_task.h>
#include <low_touch_task.h>
#include <sensor_adpd_application_interface.h>
#include <sensor_adxl_application_interface.h>
#include <sensor_ad7156_application_interface.h>
#include <ppg_application_interface.h>
#include <ecg_application_interface.h>
#include <eda_application_interface.h>
#include <pedometer_application_interface.h>
#ifdef LOW_TOUCH_FEATURE
#include "dcb_general_block.h"
#endif
#include <sqi_application_interface.h>
#include "display_app.h"
#include "light_fs.h"

/* subscriber backup */
static M2M2_ADDR_ENUM_t SubsGlobalSrc = M2M2_ADDR_UNDEFINED;
/* filesrc backup */
static M2M2_ADDR_ENUM_t FileSrc = M2M2_ADDR_UNDEFINED;
/* Stop source backup */
static FILE_STOP_LOGGING_t StopSrc = M2M2_FILE_SYS_STOP_LOGGING_INVALID;
void file_system_task(void *pArgument);
uint8_t get_file_system_subs_count(void);
bool fs_unsubscribe_streams(void);
static void fs_send_write_error(M2M2_ADDR_ENUM_t *src);
static void fs_stream_usubscribe();
extern m2m2_pm_sys_info_t g_system_info;
#define NAND_READ_TEST
#define NAND_WRITE_TEST
#undef NAND_WRITE_TEST
#undef NAND_READ_TEST
#ifdef NAND_READ_TEST
static uint16_t g_read_time = 0;
static uint64_t g_file_read_time=0;
static uint32_t g_file_read_cnt = 0;
#endif /* NAND_READ_TEST */

#ifdef NAND_WRITE_TEST
static uint32_t g_write_time = 0;
static uint64_t g_file_write_time = 0;
#endif

static uint32_t n500bChunkCnt = 0;
extern uint8_t ConfigFileName[16];
static char PatternFileName[16] = "PATTERN.LOG";

/* If an application is not found in the routing table,
    then this default ADDR_UNDEFINED is used. */
#define M2M2_ADDRESS_DEFAULT  M2M2_ADDR_UNDEFINED
#define FS_ECG_APP_MAX_LCFG_OPS (4)

/* Size of flash in bytes = 2048 * 64 * 4096 */
#define FLASH_SIZE                      536870912

/* Total num of pages in Flash */
#define TOTAL_NUM_OF_PAGES              (FLASH_SIZE/PAGE_SIZE)
/* ADI_FS_FILE_MAX_SIZE is the no of pages allocated
   for data files = 2044 * 64 */
#define ADI_FS_FILE_MAX_SIZE            130816

#ifdef PATTERN_WRITE_ENABLED
static volatile uint32_t gs2kChunkCnt = 0;
static uint8_t pArr[PAGE_SIZE];
#endif
static volatile bool gMemoryFull = false;
uint32_t nTick = 0;
extern uint64_t sum;
static uint8_t gnadpd_dcfg_tx_PacketCount = 0;

#define ADI_FS_STREAM_STARTED   0x01
#define ADI_FS_STREAM_STOPPED   0x00

uint8_t ga_fs_task_stack[APP_OS_CFG_FS_TASK_STK_SIZE];
ADI_OSAL_THREAD_HANDLE gh_fs_task_handler;
ADI_OSAL_STATIC_THREAD_ATTR g_fs_task_attributes;
StaticTask_t g_fs_task_tcb;
ADI_OSAL_QUEUE_HANDLE  gh_fs_task_msg_queue = NULL;

volatile uint8_t fs_download_total_pkt_cnt = 0;
extern uint8_t total_packet_cnt_transferred;
#ifdef ENABLE_WATCH_DISPLAY
extern uint16_t min_timer_cnt;
extern uint16_t fs_display_query_cnt;
#endif
uint8_t fs_status_stored = 0;
uint32_t num_bytes_processed = 0;
uint8_t append_req = 0;

/* keep disabled this feature by default */
bool file_append=false;

#ifdef LOW_TOUCH_FEATURE
extern uint8_t gSendRespToPmApp;
extern uint8_t ConfigFileName[16];
#endif /* LOW_TOUCH_FEATURE */

#include "nrf_log_ctrl.h"
#define NRF_LOG_MODULE_NAME FS_TASK

#if FS_TASK_CONFIG_LOG_ENABLED
#ifdef NRF_LOG_DEFAULT_LEVEL
#undef NRF_LOG_DEFAULT_LEVEL
#define NRF_LOG_DEFAULT_LEVEL FS_TASK_CONFIG_LOG_LEVEL
#endif
#define NRF_LOG_INFO_COLOR  FS_TASK_CONFIG_INFO_COLOR
#define NRF_LOG_DEBUG_COLOR FS_TASK_CONFIG_DEBUG_COLOR
#else /* FS_TASK_CONFIG_LOG_ENABLED */
#define NRF_LOG_LEVEL       0
#endif /* FS_TASK_CONFIG_LOG_ENABLED */

#include "nrf_log.h"
NRF_LOG_MODULE_REGISTER();

ADI_OSAL_SEM_HANDLE   qspi_task_evt_sem;
ADI_OSAL_SEM_HANDLE   fs_task_evt_sem;
/* semaphore handler for low touch task */
extern ADI_OSAL_SEM_HANDLE   lt_task_evt_sem;
#ifdef USER0_CONFIG_APP
#include "user0_config_app_task.h"
extern ADI_OSAL_SEM_HANDLE   user0_config_app_evt_sem;
#endif
extern uint8_t setFsDownloadFlag(uint8_t flag);
extern uint8_t get_file_download_chunk_count();
#ifdef ENABLE_WATCH_DISPLAY
extern void reset_display_vol_info();
#ifdef CUST4_SM
extern void reset_display_vol_info1();
#endif
#endif
extern volatile uint8_t gsCfgFileFoundFlag;
/* this is made global variable to handler start log response/appended response*/
uint16_t appended_status = (M2M2_FILE_SYS_STATUS_ENUM_t)M2M2_FILE_SYS_STATUS_ERROR;
#ifdef PROFILE_TIME_ENABLED
extern uint32_t num_bytes_transferred,usb_avg_tx_time,usb_avg_cdc_write_time;
extern uint32_t min_file_read_time,avg_file_read_time,max_file_read_time;
extern uint16_t num_times_read;
extern uint32_t usb_min_cdc_time,usb_max_cdc_time;
extern uint32_t usb_min_tx_time,usb_max_tx_time;
uint32_t delay_time, total_time_taken_512_bytes_transfer;
extern uint32_t max_num_of_retries;
#endif

/*!
* @brief:  Data structure to define routing table entry in the filesystem
*/
typedef struct _file_routing_table_entry {
  M2M2_ADDR_ENUM_t address;
  M2M2_ADDR_ENUM_t stream;
  FILE_SYS_STREAM_SUBS_STATE_ENUM_t fs_subs_state;
}file_routing_table_entry;

/*!
* @brief:  Data structure used for file download
*/
struct _fs_stream {
  FS_STATUS_ENUM_t fs_err_status;
  char file_path[16];
  uint8_t page_chunk_number;
  uint32_t fs_buffer_size;
  uint32_t processed_data_len;
  uint32_t data_chunk_len;
  uint32_t num_bytes_left;
  uint32_t file_start_page_number;
  uint32_t current_page_number;
  uint8_t  file_buff[8*MEMBER_SIZE(m2m2_file_sys_download_log_stream_t, page_chunk_bytes)];
  M2M2_ADDR_ENUM_t pkt_src;
  M2M2_ADDR_ENUM_t pkt_dest;
}fs_stream;

#define MAX_PAGE_CHUNK_COUNT  PAGE_SIZE/MEMBER_SIZE(m2m2_file_sys_download_log_stream_t, page_chunk_bytes)
#define CRC_COMPUTE_LENGTH(page_chunk_size) page_chunk_size + M2M2_HEADER_SZ + \
                                            (sizeof(m2m2_file_sys_download_log_stream_t) - \
                                            (MEMBER_SIZE(m2m2_file_sys_download_log_stream_t, page_chunk_bytes) + \
                                            MEMBER_SIZE(m2m2_file_sys_download_log_stream_t, crc16)))
/*!
* @brief:  Array used for checking the subscription of a stream to file system
*/
static file_routing_table_entry file_routing_table[] = {
  {M2M2_ADDR_SENSOR_ADPD4000,       M2M2_ADDR_SENSOR_ADPD_STREAM1,        M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_SENSOR_ADPD4000,       M2M2_ADDR_SENSOR_ADPD_STREAM2,        M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_SENSOR_ADPD4000,       M2M2_ADDR_SENSOR_ADPD_STREAM3,        M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_SENSOR_ADPD4000,       M2M2_ADDR_SENSOR_ADPD_STREAM4,        M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_SENSOR_ADPD4000,       M2M2_ADDR_SENSOR_ADPD_STREAM5,        M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_SENSOR_ADPD4000,       M2M2_ADDR_SENSOR_ADPD_STREAM6,        M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_SENSOR_ADPD4000,       M2M2_ADDR_SENSOR_ADPD_STREAM7,        M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_SENSOR_ADPD4000,       M2M2_ADDR_SENSOR_ADPD_STREAM8,        M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_SENSOR_ADPD4000,       M2M2_ADDR_SENSOR_ADPD_STREAM9,        M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_SENSOR_ADPD4000,       M2M2_ADDR_SYS_STATIC_AGC_STREAM,      M2M2_FILE_SYS_UNSUBSCRIBED},
#ifdef ENABLE_DEBUG_STREAM
  {M2M2_ADDR_SENSOR_ADPD4000,       M2M2_ADDR_SYS_DBG_STREAM,             M2M2_FILE_SYS_UNSUBSCRIBED},
#endif
  {M2M2_ADDR_SENSOR_ADXL,           M2M2_ADDR_SENSOR_ADXL_STREAM,         M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_SENSOR_AD7156,         M2M2_ADDR_SENSOR_AD7156_STREAM,       M2M2_FILE_SYS_UNSUBSCRIBED},
#ifdef ENABLE_PPG_APP
  {M2M2_ADDR_MED_PPG,               M2M2_ADDR_MED_PPG_STREAM,             M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_MED_PPG,               M2M2_ADDR_SYS_DYNAMIC_AGC_STREAM,     M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_MED_PPG,               M2M2_ADDR_SYS_HRV_STREAM,             M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_MED_SYNC_ADPD_ADXL,    M2M2_ADDR_MED_SYNC_ADPD_ADXL_STREAM,  M2M2_FILE_SYS_UNSUBSCRIBED},
#endif
#ifdef ENABLE_PEDO_APP
  {M2M2_ADDR_MED_PED,               M2M2_ADDR_MED_PED_STREAM,             M2M2_FILE_SYS_UNSUBSCRIBED},
#endif
#ifdef ENABLE_EDA_APP
  {M2M2_ADDR_MED_EDA,               M2M2_ADDR_MED_EDA_STREAM,             M2M2_FILE_SYS_UNSUBSCRIBED},
#endif
#ifdef ENABLE_ECG_APP
  {M2M2_ADDR_MED_ECG,               M2M2_ADDR_MED_ECG_STREAM,             M2M2_FILE_SYS_UNSUBSCRIBED},
#endif
#ifdef ENABLE_TEMPERATURE_APP
  {M2M2_ADDR_MED_TEMPERATURE,       M2M2_ADDR_MED_TEMPERATURE_STREAM,     M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_MED_TEMPERATURE,       M2M2_ADDR_MED_TEMPERATURE_STREAM1,     M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_MED_TEMPERATURE,       M2M2_ADDR_MED_TEMPERATURE_STREAM2,     M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_MED_TEMPERATURE,       M2M2_ADDR_MED_TEMPERATURE_STREAM3,     M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_MED_TEMPERATURE,       M2M2_ADDR_MED_TEMPERATURE_STREAM4,     M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_MED_TEMPERATURE,       M2M2_ADDR_MED_TEMPERATURE_STREAM5,     M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_MED_TEMPERATURE,       M2M2_ADDR_MED_TEMPERATURE_STREAM6,     M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_MED_TEMPERATURE,       M2M2_ADDR_MED_TEMPERATURE_STREAM7,     M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_MED_TEMPERATURE,       M2M2_ADDR_MED_TEMPERATURE_STREAM8,     M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_MED_TEMPERATURE,       M2M2_ADDR_MED_TEMPERATURE_STREAM9,     M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_MED_TEMPERATURE,       M2M2_ADDR_MED_TEMPERATURE_STREAM10,     M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_MED_TEMPERATURE,       M2M2_ADDR_MED_TEMPERATURE_STREAM11,     M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_MED_TEMPERATURE,       M2M2_ADDR_MED_TEMPERATURE_STREAM12,     M2M2_FILE_SYS_UNSUBSCRIBED},
#endif
#ifdef ENABLE_BIA_APP
  {M2M2_ADDR_MED_BIA,               M2M2_ADDR_MED_BIA_STREAM,             M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_MED_BIA,               M2M2_ADDR_BCM_ALGO_STREAM,             M2M2_FILE_SYS_UNSUBSCRIBED},
#endif
#ifdef ENABLE_SQI_APP
  {M2M2_ADDR_MED_SQI,               M2M2_ADDR_MED_SQI_STREAM,             M2M2_FILE_SYS_UNSUBSCRIBED},
#endif
  {M2M2_ADDR_APP_CLI,               M2M2_ADDR_APP_CLI_STREAM,             M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_APP_IOS,               M2M2_ADDR_APP_IOS_STREAM,             M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_APP_WT,                M2M2_ADDR_APP_WT_STREAM,              M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_APP_DROID,             M2M2_ADDR_APP_DROID_STREAM,           M2M2_FILE_SYS_UNSUBSCRIBED},
  {M2M2_ADDR_SYS_PM,                M2M2_ADDR_SYS_BATT_STREAM,            M2M2_FILE_SYS_UNSUBSCRIBED},
};

/* Number of entries in the routing table */
#define FILE_ROUTING_TABLE_SIZE (sizeof(file_routing_table)/sizeof(file_routing_table[0]))

/* Number of adpd streams in routing table */
#define MAX_NUMBER_OF_ADPD_STREAM (M2M2_ADDR_SENSOR_ADPD_STREAM9 - M2M2_ADDR_SENSOR_ADPD_STREAM1)
/*!
  ****************************************************************************
    @brief Finds the number of streams subscribed to file system

    @param[in]                 - None

    @return                    count: No of streams subscribed to file system
*****************************************************************************/
uint8_t get_file_system_subs_count(void) {
  uint8_t count = 0;
  for(int i = 0; i < FILE_ROUTING_TABLE_SIZE; i++) {
    if(file_routing_table[i].fs_subs_state == M2M2_FILE_SYS_SUBSCRIBED)
      count++;
  }
  return count;
}

/* FS task priority used while downloading the logs from the flash
  For proper functioning of fs_stream command, FS TASK should have
  priority above USB TX task */
#define FS_APP_DOWNLOAD_PRIO  APP_OS_CFG_USBD_TX_TASK_PRIO+1
uint8_t gsFsDownloadReqByExtTool = 0;
extern uint32_t TimeOutCount;


/*!
  ****************************************************************************
    @brief Changes the priority fs task above the usb tx task

    @param[in]                    - None

