ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/file_system_task.c
    @return ADI_OSAL_SUCCESS      - If successfully changed the priority of the
                                    specified thread
    @return ADI_OSAL_BAD_PRIORITY - If the specified priority is invalid
    @return ADI_OSAL_CALLER_ERROR - If the function is invoked from an invalid
                                    location (i.e an ISR)
    @return ADI_OSAL_BAD_HANDLE   -  If the specified thread handle is invalid
    @see adi_osal_ThreadGetPrio
*****************************************************************************/
ADI_OSAL_STATUS hike_fs_prio(void)
{
  return(adi_osal_ThreadSetPrio(gh_fs_task_handler,FS_APP_DOWNLOAD_PRIO));
}

/*!
  ****************************************************************************
    @brief Reverts the FS priority which changed during download (fs_stream)
           operation to its initial priority level

    @param[in]                    - None

    @return ADI_OSAL_SUCCESS      - If successfully changed the priority of the
                                    specified thread
    @return ADI_OSAL_BAD_PRIORITY - If the specified priority is invalid
    @return ADI_OSAL_CALLER_ERROR - If the function is invoked from an invalid
                                    location (i.e an ISR)
    @return ADI_OSAL_BAD_HANDLE   -  If the specified thread handle is invalid
    @see adi_osal_ThreadGetPrio
*****************************************************************************/
ADI_OSAL_STATUS revert_fs_prio(void)
{
  return(adi_osal_ThreadSetPrio(gh_fs_task_handler,APP_OS_CFG_FS_TASK_PRIO));
}

/*!
  ****************************************************************************
    @brief File system initialization including thread creation

    @param[in]                    - None

    @return                       - None
*****************************************************************************/
void file_system_task_init(void) {
#ifdef USE_FS
  ADI_OSAL_STATUS eOsStatus;
  /* Create file system thread */
  g_fs_task_attributes.pThreadFunc = file_system_task;
  g_fs_task_attributes.nPriority = APP_OS_CFG_FS_TASK_PRIO;
  g_fs_task_attributes.pStackBase = &ga_fs_task_stack[0];
  g_fs_task_attributes.nStackSize = APP_OS_CFG_FS_TASK_STK_SIZE;
  g_fs_task_attributes.pTaskAttrParam = NULL;
  g_fs_task_attributes.szThreadName = "file_system_task";
  g_fs_task_attributes.pThreadTcb = &g_fs_task_tcb;
  eOsStatus = adi_osal_MsgQueueCreate(&gh_fs_task_msg_queue,NULL,100);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
      Debug_Handler();
  }
  else
  {
    update_task_queue_list(APP_OS_CFG_FS_TASK_INDEX,gh_fs_task_msg_queue);
  }

  eOsStatus = adi_osal_ThreadCreateStatic(&gh_fs_task_handler,
                                    &g_fs_task_attributes);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
      Debug_Handler();
  }

  adi_osal_SemCreate(&qspi_task_evt_sem, 0);
  adi_osal_SemCreate(&fs_task_evt_sem, 0);
#endif
}

/*!
  ****************************************************************************
    @brief Initializes the test pattern buffer

    @param[in]        pBuff: Pointer to the test buffer

    @param[in]        nBufSize: Size of test buffer

    @return           None
*****************************************************************************/
static void InitTestBuffer(uint8_t *pBuff, uint32_t nBufSize)
{
    for (uint32_t nIndex = 0; nIndex < nBufSize; nIndex += 4)
    {
        pBuff[nIndex] = 0xDE;
        pBuff[nIndex + 1] = 0xAD;
        pBuff[nIndex + 2] = 0xBE;
        pBuff[nIndex + 3] = 0xEF;
    }
   NRF_LOG_INFO("Verify test pattern");
}

/*!
  ****************************************************************************
    @brief Sends the message packet to the post office

    @param[in]        p_pkt: Pointer to the packet

    @return           None
*****************************************************************************/
uint32_t gFileSystemMsgPostCnt =0;
uint32_t gFileSystemMsgProcessCnt =0;
uint32_t FS_msg_fail_tick = 0, g_fs_status_reps_tick = 0;
void send_message_file_system_task(m2m2_hdr_t *p_pkt) {
  ADI_OSAL_STATUS osal_result;
  osal_result = adi_osal_MsgQueuePost(gh_fs_task_msg_queue, p_pkt);
  if (osal_result != ADI_OSAL_SUCCESS)
  {
    FS_msg_fail_tick = get_sensor_time_stamp();
    post_office_consume_msg(p_pkt);
  }
  else
    gFileSystemMsgPostCnt++;
}

uint8_t get_fs_logging_status(void)
{
    if (FileSrc != M2M2_ADDR_UNDEFINED) {
      return (M2M2_FILE_SYS_STATUS_LOGGING_IN_PROGRESS);
    }else {
      return (M2M2_FILE_SYS_STATUS_LOGGING_NOT_STARTED);
    }
}

M2M2_FILE_SYS_STATUS_ENUM_t get_fs_available_memory(uint32_t *p_available_mem)
{
    uint32_t VolumeInfo[3] = {0};
    if (fs_hal_get_vol_info(VolumeInfo) == FS_STATUS_OK) {
      *p_available_mem = VolumeInfo[2];
      return M2M2_FILE_SYS_STATUS_OK;
    }
    else  {
      *p_available_mem=0;
       return M2M2_FILE_SYS_STATUS_ERROR;
    }
}


/*!
  ****************************************************************************
    @brief Retrieves the stream address, if present, from the routing table
            if the stream is not present, then returns the default address
            as M2M2_ADDR_UNDEFINED

    @param[in]        stream: ENUM for the stream

    @return           M2M2_ADDR_ENUM_t
*****************************************************************************/
M2M2_ADDR_ENUM_t get_file_routing_table_entry(M2M2_ADDR_ENUM_t stream) {
  for (int i = 0; i < FILE_ROUTING_TABLE_SIZE; i++) {
    if (file_routing_table[i].stream == stream) {
      return file_routing_table[i].address;
    }
  }
  return M2M2_ADDRESS_DEFAULT;
}

/*!
  ****************************************************************************
    @brief Retrieves the stream, if present, from the routing table
            if the address is not present, then returns the default address
            as M2M2_ADDR_UNDEFINED

    @param[in]        address: ENUM for the application address

    @return           M2M2_ADDR_ENUM_t
*****************************************************************************/
M2M2_ADDR_ENUM_t get_file_routing_table_entry_stream(M2M2_ADDR_ENUM_t address) {
  for (int i = 0; i < FILE_ROUTING_TABLE_SIZE; i++) {
    if (file_routing_table[i].address == address) {
      return file_routing_table[i].stream;
    }
  }
  return M2M2_ADDRESS_DEFAULT;
}

/*!
  ****************************************************************************
    @brief Retrieves the stream index, if present, from the routing table
            if the stream is not present, then returns -1

    @param[in]        stream: ENUM for the stream

    @return           index, if stream is present in routing table
                             else -1
*****************************************************************************/
int16_t get_file_routing_table_index(M2M2_ADDR_ENUM_t stream) {
  for (int i = 0; i < FILE_ROUTING_TABLE_SIZE; i++) {
    if (file_routing_table[i].stream == stream) {
      return i;
    }
  }
  return -1;
}
/*!
  ****************************************************************************
    @brief Retrieves the subscription status of ADPD application, if present,
            from the routing table. If the appliation is not present, then
            returns M2M2_FILE_SYS_SUBS_INVALID

    @param[in]        None

    @return           FILE_SYS_STREAM_SUBS_STATE_ENUM_t
*****************************************************************************/
FILE_SYS_STREAM_SUBS_STATE_ENUM_t get_adpd_address_sub_state() {
  for(int i = 0; i < MAX_NUMBER_OF_ADPD_STREAM; i++){
    if(file_routing_table[i].fs_subs_state == M2M2_FILE_SYS_SUBSCRIBED){
      return M2M2_FILE_SYS_SUBSCRIBED;
    }
  }
  return M2M2_FILE_SYS_SUBS_INVALID;
}

/*!
  ****************************************************************************
    @brief Retrieves the subscription status of an application, if present,
            from the routing table. If the appliation is not present, then
            returns M2M2_FILE_SYS_SUBS_INVALID

    @param[in]        addr: ENUM for the application address

    @return           FILE_SYS_STREAM_SUBS_STATE_ENUM_t
*****************************************************************************/
FILE_SYS_STREAM_SUBS_STATE_ENUM_t get_address_sub_state(M2M2_ADDR_ENUM_t addr) {
  if(addr == M2M2_ADDR_SENSOR_ADPD4000)
    return get_adpd_address_sub_state(); // if its ADPD4000 check for all the ADPD streams for sub state
  for (int i = 0; i < FILE_ROUTING_TABLE_SIZE; i++) {
    if (file_routing_table[i].address == addr) {
      return file_routing_table[i].fs_subs_state;
    }
  }
  return M2M2_FILE_SYS_SUBS_INVALID;
}

/*!
* @brief:  The data structure used to debug checksum and missed stream
*           packets in the filesystem.
*/
typedef struct _file_misd_packet_debug_table {
  M2M2_ADDR_ENUM_t stream;
  uint16_t count;
  uint32_t totalpacketcount;
  uint32_t missedpackets;
}file_misd_packet_debug_table;

/*!
* @brief:  The array used to debug checksum and missed stream
*           packets in the filesystem.
*/
static file_misd_packet_debug_table file_misd_packet_table[] = {
  {M2M2_ADDR_SENSOR_ADPD_STREAM1,0,0,0},
  {M2M2_ADDR_SENSOR_ADXL_STREAM,0,0,0},
  {M2M2_ADDR_SENSOR_AD7156_STREAM,0,0,0},
  {M2M2_ADDR_MED_PPG_STREAM,0,0,0},
  {M2M2_ADDR_MED_PED_STREAM,0,0,0},
#ifdef UNUSED_CODES
  {M2M2_ADDR_MED_AGC_STREAM,0,0,0},
#endif
  {M2M2_ADDR_MED_EDA_STREAM,0,0,0},
  {M2M2_ADDR_MED_ECG_STREAM,0,0,0},
  {M2M2_ADDR_MED_BIA_STREAM,0,0,0},
  {M2M2_ADDR_BCM_ALGO_STREAM,0,0,0},
  {M2M2_ADDR_MED_SQI_STREAM,0,0,0},
  {M2M2_ADDR_MED_TEMPERATURE_STREAM,0,0,0},
  {M2M2_ADDR_MED_SYNC_ADPD_ADXL_STREAM,0,0,0},
#ifdef UNUSED_CODES
  {M2M2_ADDR_APP_DROID_STREAM,0,0,0},
  {M2M2_ADDR_APP_WT_STREAM,0,0,0},
#endif
  {M2M2_ADDR_APP_CLI_STREAM,0,0,0},
  {M2M2_ADDR_APP_DISPLAY_STREAM,0,0,0},
  {M2M2_ADDR_SYS_BATT_STREAM,0,0,0},
#ifdef UNUSED_CODES
  {M2M2_ADDR_APP_IOS_STREAM,0,0,0},
  {M2M2_ADDR_MED_AD7689_STREAM,0,0,0},
#endif
};

