ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/file_system_task.c
/* Number of entries in the file system debug table */
#define FILE_DEBUG_TABLE_SIZE (sizeof(file_misd_packet_table)/sizeof(file_misd_packet_table[0]))

/*!
  ****************************************************************************
    @brief Retrieves the stream index of a stream, if present,
            from the file system debug table.
            If the stream is not present, then returns -1

    @param[in]        stream: ENUM for the stream address

    @return           int16_t
*****************************************************************************/
int16_t get_file_misd_packet_table_index(M2M2_ADDR_ENUM_t stream) {
  for (int i = 0; i < FILE_DEBUG_TABLE_SIZE; i++) {
    if (file_misd_packet_table[i].stream == stream) {
      return i;
    }
  }
  return -1;
}

/*!
  ****************************************************************************
    @brief Retrieves the stream debug information, if present,
            from the file system debug table.

    @param[in]        debug_info: structure holding debug information

    @return           None
*****************************************************************************/
#ifdef PAGE_READ_DEBUG_INFO
extern uint32_t last_page_read;
extern uint32_t last_page_read_offset;
extern uint8_t last_page_read_status;
extern uint32_t num_bytes_transferred;
extern uint32_t bytes_processed_from_fs_task;
extern uint8_t usb_cdc_write_failed;
#endif

#ifdef FORMAT_DEBUG_INFO_CMD
extern fs_format_debug_info tmp_fs_format_debug_info;
#endif
void get_file_misd_packet_debug_info(m2m2_file_sys_debug_info_resp_t *debug_info) {
    for (int i = 0; i < FILE_DEBUG_TABLE_SIZE; i++) {
    if (file_misd_packet_table[i].stream == debug_info->stream) {
      debug_info->packets_received = file_misd_packet_table[i].totalpacketcount;
      debug_info->packets_missed = file_misd_packet_table[i].missedpackets;
    }
  }

#ifdef PAGE_READ_DEBUG_INFO
  debug_info->last_page_read = last_page_read;
  debug_info->last_page_read_offset = last_page_read_offset;
  debug_info->last_page_read_status = last_page_read_status;
  debug_info->num_bytes_transferred = num_bytes_transferred;
  debug_info->bytes_read = bytes_processed_from_fs_task;
  debug_info->usb_cdc_write_failed = usb_cdc_write_failed;
#else
  debug_info->last_page_read  = 0;
  debug_info->last_page_read_offset = 0;
  debug_info->last_page_read_status  = 0;
  debug_info->num_bytes_transferred = 0;
  debug_info->bytes_read = 0;
  debug_info->usb_cdc_write_failed = 0;
#endif
  NRF_LOG_INFO("bytes proc=%d",debug_info->bytes_read);
}

#ifdef FORMAT_DEBUG_INFO_CMD
/*!
  ***************************************************************************************************
    @brief            get fs format debug info

    @param[in]        debug_info: Pointer to structure m2m2_file_sys_format_debug_info_resp_t

    @return           void
****************************************************************************************************/
void get_fs_format_debug_info(m2m2_file_sys_format_debug_info_resp_t *debug_info) {
    debug_info->format_src_blk_ind = tmp_fs_format_debug_info.format_src_blk_ind;
    debug_info->format_dest_blk_ind_1 = tmp_fs_format_debug_info.format_dest_blk_ind_1;
    debug_info->format_dest_blk_ind_2 = tmp_fs_format_debug_info.format_dest_blk_ind_2;
    debug_info->wrap_around_cond = tmp_fs_format_debug_info.wrap_around_cond;
    debug_info->erase_failed_due_bad_block_check = tmp_fs_format_debug_info.erase_failed_due_bad_block_check;
    debug_info->nothing_is_written_to_erase_error = tmp_fs_format_debug_info.nothing_is_written_to_erase_error;
    debug_info->mem_full_in_partial_erase = tmp_fs_format_debug_info.mem_full_in_partial_erase;
    debug_info->num_blocks_erased_in_mem_full_partial_erase = tmp_fs_format_debug_info.num_blocks_erased_in_mem_full_partial_erase;
    debug_info->num_blocks_erased_in_partial_erase_1 = tmp_fs_format_debug_info.num_blocks_erased_in_partial_erase_1;
    debug_info->num_blocks_erased_in_partial_erase_2 = tmp_fs_format_debug_info.num_blocks_erased_in_partial_erase_2;
    debug_info->num_times_format_failed_due_bad_blocks_1 = tmp_fs_format_debug_info.num_times_format_failed_due_bad_blocks_1;
    debug_info->num_times_format_failed_due_bad_blocks_2 = tmp_fs_format_debug_info.num_times_format_failed_due_bad_blocks_2;
    debug_info->toc_mem_erased_flag = tmp_fs_format_debug_info.toc_mem_erased_flag;
    debug_info->succesfull_erase_flag = tmp_fs_format_debug_info.succesfull_erase_flag;
  }
#endif

/*!
  ****************************************************************************
    @brief Unsubscribes the streams subscribed to file system

    @param[in]        None

    @return           bool:true if no stream is subscribed, else false
*****************************************************************************/
bool fs_unsubscribe_streams(void) {
  m2m2_hdr_t *pkt = NULL;
  ADI_OSAL_STATUS err;
  uint8_t sub_cnt = 0;

  /* Check for stream subscription and send Unsub Req to stream */
  for(int i = 0; i<FILE_ROUTING_TABLE_SIZE; i++) {
    if(file_routing_table[i].fs_subs_state == M2M2_FILE_SYS_SUBSCRIBED) {
      pkt = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_log_stream_t));
      if (pkt != NULL) {
        m2m2_file_sys_log_stream_t *unsubscribe_req = (m2m2_file_sys_log_stream_t*)&pkt->data[0];
        unsubscribe_req->command = M2M2_FILE_SYS_CMD_STOP_STREAM_REQ;
        unsubscribe_req->status = M2M2_APP_COMMON_STATUS_OK;
        pkt->src = M2M2_ADDR_SYS_FS;
        pkt->dest = M2M2_ADDR_SYS_FS;
        unsubscribe_req->stream = file_routing_table[i].stream;
        post_office_send(pkt, &err);
        sub_cnt++;
      }
    }
  }
  /* Return true if no stream is subscribed */
  if(sub_cnt == 0)
    return true;
  else
    return false;
}

/*!
  ****************************************************************************
    @brief Find the configuration file in the configuration block

    @param[in]        pCfgFileFoundFlag: flag indicating the config file

