ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/file_system_task.c
    @return           None
*****************************************************************************/
void FindConfigFile(volatile uint8_t* pCfgFileFoundFlag)
{
 uint8_t cfgFileFoundFlag;
 if (fs_flash_power_on(true) == FS_STATUS_OK) {
    fs_hal_find_config_file(ConfigFileName, sizeof(ConfigFileName),0, &cfgFileFoundFlag);
    *pCfgFileFoundFlag = cfgFileFoundFlag;
  }
  if (fs_flash_power_on(false)  != FS_STATUS_OK){
    NRF_LOG_INFO("Error in flash power off");
  }
}

/* macros, array and variables used for injecting kep ID before a log */
#define M2M2_KEY_ID 0xC0FF
#define M2M2_DEFAULT_KEY_ID 0xFFFF
static m2m2_file_sys_set_key_value_pair_resp_t g_userinfo = {0,0,M2M2_DEFAULT_KEY_ID,{0x00},0,0,0,0,0,0,0};
static uint8_t FileStreamSubsciberCount = 0;
static volatile uint8_t fs_download_chunk_cnt = 0;
uint8_t  fs_stream_state = ADI_FS_STREAM_STOPPED;
uint8_t fs_last_cmd = 0;

#ifdef PROFILE_TIME_ENABLED
extern uint64_t g_page_hold_write_time;
#endif


/*!
  ****************************************************************************
    @brief Gets the file download status

    @param[in]        None

    @return           bool: true if started, else false
*****************************************************************************/
bool get_download_status()
{
  if(fs_stream_state == ADI_FS_STREAM_STARTED)
    return true;
  else
    return false;
}


/*!
  ****************************************************************************
    @brief            Close opened
                      file before watch reset if logging is happening.

    @param[in]        None

    @return           bool: true if started, else false
*****************************************************************************/

bool UpdateFileInfo(){
  FS_STATUS_ENUM_t fs_error;
  if(fs_hal_write_access_state() == FS_FILE_ACCESS_IN_PROGRESS) {
    /* close file */
    fs_error = fs_hal_close_file(fs_hal_write_file_pointer());
    if(fs_error == FS_STATUS_OK) {
       fs_flash_power_on(false);
    }
    else{
    /* error handling when file is not closed properly */
      return false;
    }
  }
  return true;
}

/*!
  ****************************************************************************
* @brief      Commands and response for file system task interface
* @param      pArgument not used
* @return     None
  ****************************************************************************/
#ifdef ADPD_SEM_CORRUPTION_DEBUG
 uint32_t start_log_counter_rx=0;
 uint32_t stop_log_counter_rx=0;
 uint32_t start_fs_sub_rx=0;
 uint32_t stop_fs_sub_rx=0;
#endif

#ifdef DEBUG_LOG_START
  uint32_t start_log_timer_start=0;
  uint32_t get_file_count_timer_start=0;
  uint32_t fs_sub_timer_start=0;
  uint32_t fs_sub_timer_gap=0;
  uint32_t get_file_count_timer_gap=0;
  uint32_t start_log_timer_gap=0;
  uint32_t vol_info_timer_start=0;
  uint32_t vol_info_timer_gap=0;
#endif

void file_system_task(void *pArgument) {
  m2m2_hdr_t                            *pkt = NULL;
  ADI_OSAL_STATUS                       err;
  bool                                  file_hdr_wr_progress = false;
  uint8_t                               fs_stream_final_buffer = 1;
  uint16_t                              nSeqNum = 0;
  static uint32_t                       timeout = ADI_OSAL_TIMEOUT_FOREVER;
  M2M2_ADDR_ENUM_t                      nTempAdress;

#ifdef DEBUG_LOG_START
         us_timer_init();
#endif /* PROFILE_TIME_ENABLED */

  /* flash power on */
  adp5360_enable_ldo(FS_LDO,true);

  if(fs_hal_init() == FS_STATUS_INIT_DRIVER_ERR){
      /* delete thread, only if driver error */
      adi_osal_ThreadDestroy(gh_fs_task_handler);
  }

  /* flash power off */
  adp5360_enable_ldo(FS_LDO,false);


  /* Create a mailbox for FS stream */
  pkt = post_office_create_msg(M2M2_HEADER_SZ + sizeof(post_office_config_t));
  if(pkt != NULL) {
    post_office_config_t *payload = (post_office_config_t *)&pkt->data[0];
    pkt->src = M2M2_ADDR_SYS_FS;
    pkt->dest = M2M2_ADDR_POST_OFFICE;
    pkt->length = M2M2_HEADER_SZ + sizeof(post_office_config_t);

    payload->box = M2M2_ADDR_SYS_FS_STREAM;
    payload->cmd = POST_OFFICE_CFG_CMD_ADD_MAILBOX;
    post_office_send(pkt, &err);
  }

  /*Wait for FDS init to complete*/
  adi_osal_SemPend(fs_task_evt_sem, ADI_OSAL_TIMEOUT_FOREVER);

  FindConfigFile(&gsCfgFileFoundFlag);
#ifdef LOW_TOUCH_FEATURE

  adi_osal_SemPost(lt_task_evt_sem);
#ifdef CUST4_SM
  /*If wakeup from RTC timer interrupt, switch to intermittent operation
   And for that send message that the config file update status is ready*/
  USER0_CONFIG_APP_STATE_t read_user0_config_app_state;
  read_user0_config_app_state = get_user0_config_app_state();
  if( (read_user0_config_app_state == STATE_SLEEP) ||
      (read_user0_config_app_state == STATE_INTERMITTENT_MONITORING) ||
      (read_user0_config_app_state == STATE_INTERMITTENT_MONITORING_START_LOG) ||
      (read_user0_config_app_state == STATE_INTERMITTENT_MONITORING_STOP_LOG) )
  {
     adi_osal_SemPost(user0_config_app_evt_sem);
  }
#endif
#endif

  while (1) {
    m2m2_hdr_t *response_mail = NULL;
    _m2m2_app_common_cmd_t *ctrl_cmd = NULL;
    pkt = post_office_get(timeout,APP_OS_CFG_FS_TASK_INDEX);
    if (pkt != NULL) {
//      gFileSystemMsgProcessCnt++;
      /* check for stream source to log the packet */
      nTempAdress = get_file_routing_table_entry(pkt->src);
      /* If it is NOT a stream packet */
      if (nTempAdress == M2M2_ADDRESS_DEFAULT) {
      ctrl_cmd = (_m2m2_app_common_cmd_t*)&pkt->data[0];
#ifdef ADPD_SEM_CORRUPTION_DEBUG
      if(ctrl_cmd->command == M2M2_FILE_SYS_CMD_START_LOGGING_REQ){
        start_log_counter_rx += 1;
      }
      else if(ctrl_cmd->command == M2M2_FILE_SYS_CMD_STOP_LOGGING_REQ){
        stop_log_counter_rx += 1;
      }
      else if(ctrl_cmd->command == M2M2_FILE_SYS_CMD_LOG_STREAM_REQ){
        start_fs_sub_rx += 1;
      }
      else if(ctrl_cmd->command == M2M2_FILE_SYS_CMD_STOP_STREAM_REQ){
        stop_fs_sub_rx += 1;
      }
#endif
#ifdef DEBUG_LOG_START
      if(ctrl_cmd->command == M2M2_FILE_SYS_CMD_START_LOGGING_REQ){
        start_log_timer_start = get_micro_sec();
      }
      else if(ctrl_cmd->command == M2M2_FILE_SYS_CMD_GET_NUMBER_OF_FILE_REQ){
        get_file_count_timer_start = get_micro_sec();
      }
      else if(ctrl_cmd->command == M2M2_FILE_SYS_CMD_LOG_STREAM_REQ){
        fs_sub_timer_start = get_micro_sec();
      }
       else if(ctrl_cmd->command == M2M2_FILE_SYS_CMD_VOL_INFO_REQ){
        vol_info_timer_start = get_micro_sec();
      }
#endif
      fs_last_cmd = ctrl_cmd->command;
      switch (ctrl_cmd->command) {
      case M2M2_FILE_SYS_CMD_MOUNT_REQ: {
        response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
        if (response_mail != NULL) {
          _m2m2_app_common_cmd_t *mount_resp = (_m2m2_app_common_cmd_t *)&response_mail->data[0];
          /* Power On and mount memory partition */
          if (fs_flash_power_on(true) != FS_STATUS_OK) {
            mount_resp->status = M2M2_FILE_SYS_STATUS_ERROR;
          } else {
            mount_resp->status = M2M2_FILE_SYS_STATUS_OK;
          }
          mount_resp->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_CMD_MOUNT_RESP;
          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          post_office_send(response_mail, &err);

          /* Power off Flash */
          if (fs_flash_power_on(false)  != FS_STATUS_OK){
            NRF_LOG_INFO("Error in flash power off");
          }
        }
        break;
      } case M2M2_FILE_SYS_CMD_FORMAT_REQ: {
        response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_cmd_t));
        if (response_mail != NULL) {
          m2m2_file_sys_cmd_t *format_resp = (m2m2_file_sys_cmd_t *)&response_mail->data[0];
          /* Switch on and mount memory */
          if (fs_flash_power_on(true) == FS_STATUS_OK) {
            /* Format memory partition */
            /* Deletes only the data files; preserves config files */
            if(fs_hal_format(false) != FS_STATUS_OK) {
              format_resp->status = M2M2_FILE_SYS_ERR_FORMAT;
            }
            else {
#ifdef ENABLE_WATCH_DISPLAY
#ifdef LOW_TOUCH_FEATURE
              if(!get_low_touch_trigger_mode3_status())
#endif
                reset_display_vol_info();
#ifdef CUST4_SM
              else
                reset_display_vol_info1();
#endif
#endif//ENABLE_WATCH_DISPLAY
              format_resp->status = M2M2_FILE_SYS_STATUS_OK;
            }
          } else {
            format_resp->status = M2M2_FILE_SYS_STATUS_ERROR;
          }
          format_resp->command = M2M2_FILE_SYS_CMD_FORMAT_RESP;
          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          post_office_send(response_mail, &err);
          /* Power off Flash */
          fs_flash_power_on(false);
        }
        break;
       } /* response_mail != NULL */
#ifdef FS_TEST_CODE
        case M2M2_FILE_SYS_CMD_BLOCK_ERASE_REQ: {
        m2m2_file_sys_blk_erase_cmd_t *block_erase_req = (m2m2_file_sys_blk_erase_cmd_t *)&pkt->data[0];
        response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_blk_erase_cmd_t));
        if (response_mail != NULL) {
          m2m2_file_sys_blk_erase_cmd_t *erase_resp = (m2m2_file_sys_blk_erase_cmd_t *)&response_mail->data[0];
          /* Switch on and mount memory */
          if (fs_flash_power_on(true) == FS_STATUS_OK) {
            /* Format memory partition */
            /* Deletes only the data files; preserves config files */
            if(fs_block_erase(block_erase_req->block_no) != FS_STATUS_OK) {
              erase_resp->status = M2M2_FILE_SYS_STATUS_ERROR;
            }
            else{
              erase_resp->status = M2M2_FILE_SYS_STATUS_OK;
            }
          } else {
            erase_resp->status = M2M2_FILE_SYS_STATUS_ERROR;
          }
          erase_resp->command = M2M2_FILE_SYS_CMD_FORMAT_RESP;
          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          post_office_send(response_mail, &err);
          /* Power off Flash */
          fs_flash_power_on(false);
        }
        break;
       }
        case M2M2_FILE_SYS_WRITE_RANDOM_DATA_TO_RSD_BLK_REQ: {
        m2m2_file_sys_write_rsd_blk_cmd_t *input_payload = (m2m2_file_sys_write_rsd_blk_cmd_t *)&pkt->data[0];
        response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_write_rsd_blk_cmd_t));
        if (response_mail != NULL) {
          m2m2_file_sys_write_rsd_blk_cmd_t *random_data = (m2m2_file_sys_write_rsd_blk_cmd_t *)&response_mail->data[0];
          for(int i=0;i<MAX_NUM_OF_CHAR;i++){
            NRF_LOG_INFO("%d",input_payload->data[i]);
          }
          /* Switch on and mount memory */
          if (fs_flash_power_on(true) == FS_STATUS_OK) {
            if(fs_write_rsd_block(input_payload->data,MAX_NUM_OF_CHAR) != FS_STATUS_OK){
              random_data->status = M2M2_FILE_SYS_STATUS_ERROR;
            }
            random_data->command = M2M2_FILE_SYS_WRITE_RANDOM_DATA_TO_RSD_BLK_RESP;
            /* send response packet */
            response_mail->src = pkt->dest;
            response_mail->dest = pkt->src;
            post_office_send(response_mail, &err);
            /* Power off Flash */
            fs_flash_power_on(false);
          }
        }
        break;
       }
#endif
	case M2M2_FILE_SYS_CMD_VOL_INFO_REQ: {
        uint32_t VolumeInfo[3] = {0};
        response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_vol_info_resp_t));
        if (response_mail != NULL) {
          m2m2_file_sys_vol_info_resp_t *fs_free_space_resp = (m2m2_file_sys_vol_info_resp_t *)&response_mail->data[0];
          if(FileSrc == M2M2_ADDR_UNDEFINED) {
            /* Switch on, mount memory and get free volume size */
            if (fs_flash_power_on(true) == FS_STATUS_OK){
             if (fs_hal_get_vol_info(VolumeInfo) == FS_STATUS_OK) {
                fs_free_space_resp->totalmemory = VolumeInfo[0];
                fs_free_space_resp->usedmemory = VolumeInfo[1];
                fs_free_space_resp->availmemory = VolumeInfo[2];
  #ifdef PRINTS_OUT
              NRF_LOG_INFO("In Vol Req: Total memory = %d",fs_free_space_resp->totalmemory);
              NRF_LOG_INFO("In Vol Req: Used memory = %d",fs_free_space_resp->usedmemory);
              NRF_LOG_INFO("In Vol Req: Free memory = %d",fs_free_space_resp->availmemory);
  #endif
              fs_free_space_resp->status =(M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_STATUS_OK;
            }
            else
            {
              fs_free_space_resp->totalmemory = 0;
              fs_free_space_resp->usedmemory = 0;
              fs_free_space_resp->availmemory = 0;
              fs_free_space_resp->status = (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_STATUS_ERROR;
            }
           }else {
              fs_free_space_resp->totalmemory = 0;
              fs_free_space_resp->usedmemory = 0;
              fs_free_space_resp->availmemory = 0;
              fs_free_space_resp->status = (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_STATUS_ERROR;
           }
          } /* FileSrc == M2M2_ADDR_UNDEFINED */
          else {
          /* Switch on, mount memory and get free volume size */
            if(fs_hal_get_vol_info(VolumeInfo) == FS_STATUS_OK) {
                fs_free_space_resp->totalmemory = VolumeInfo[0];
                fs_free_space_resp->usedmemory = VolumeInfo[1];
                fs_free_space_resp->availmemory = VolumeInfo[2];
#ifdef PRINTS_OUT
                NRF_LOG_INFO("In Vol Req: Total memory = %d",fs_free_space_resp->totalmemory);
                NRF_LOG_INFO("In Vol Req: Used memory = %d",fs_free_space_resp->usedmemory);
                NRF_LOG_INFO("In Vol Req: Free memory = %d",fs_free_space_resp->availmemory);
#endif

