ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/file_system_task.c
                fs_free_space_resp->status =(M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_STATUS_OK;
#ifdef DEBUG_LOG_START
                vol_info_timer_gap = get_micro_sec() - vol_info_timer_start;
#endif
            } else {
                fs_free_space_resp->totalmemory = 0;
                fs_free_space_resp->usedmemory = 0;
                fs_free_space_resp->availmemory = 0;
                fs_free_space_resp->status = (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_STATUS_ERROR;
            }
          } /* FileSrc != M2M2_ADDR_UNDEFINED */

          fs_free_space_resp->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_CMD_VOL_INFO_RESP;
          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          post_office_send(response_mail, &err);

           /* Power off Flash */
          if(FileSrc == M2M2_ADDR_UNDEFINED) {
            if(fs_flash_power_on(false) != FS_STATUS_OK){
              NRF_LOG_INFO("Error in flash power off");
            }
          }
        } /* response_mail != NULL */
        break;
	}
#ifdef LOW_TOUCH_FEATURE
        case M2M2_FILE_SYS_CMD_FIND_CONFIG_FILE_REQ: {
          uint8_t nCfgFileFoundFlag  = 0;
          FS_STATUS_ENUM_t fs_err_status = FS_STATUS_ERR;
          fs_flash_power_on(true);
          fs_err_status = fs_hal_find_config_file(ConfigFileName, sizeof(ConfigFileName),0, &nCfgFileFoundFlag);
          response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_cmd_t));
          if (response_mail != NULL) {
            m2m2_file_sys_cmd_t *find_cfg_file_resp = (m2m2_file_sys_cmd_t *)&response_mail->data[0];
            find_cfg_file_resp->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_CMD_FIND_CONFIG_FILE_RESP;
            if(nCfgFileFoundFlag)
                find_cfg_file_resp->status = (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_CONFIG_FILE_FOUND;
            else
                find_cfg_file_resp->status = (M2M2_APP_COMMON_STATUS_ENUM_t)fs_err_status;
            response_mail->src = pkt->dest;
            response_mail->dest = pkt->src;
            /* send response packet */
            post_office_send(response_mail, &err);
          }
          fs_flash_power_on(false);
        break;
      }
#endif /* LOW_TOUCH_FEATURE */

        case M2M2_FILE_SYS_CMD_GET_NUMBER_OF_FILE_REQ: {
          uint8_t nFileCount = 0;
          FS_STATUS_ENUM_t fs_err_status = FS_STATUS_ERR;
          if(fs_flash_power_on(true) != FS_STATUS_OK){
            NRF_LOG_INFO("Error in flash power on");
          }
          fs_err_status = fs_hal_get_file_count(&nFileCount);
          response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_get_file_count_pkt_t));
          if (response_mail != NULL) {
            m2m2_file_sys_get_file_count_pkt_t *get_num_files_resp = (m2m2_file_sys_get_file_count_pkt_t *)&response_mail->data[0];
            get_num_files_resp->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_CMD_GET_NUMBER_OF_FILE_RESP;
            get_num_files_resp->status = (M2M2_APP_COMMON_STATUS_ENUM_t)fs_err_status;
            get_num_files_resp->file_count = nFileCount;
            response_mail->src = pkt->dest;
            response_mail->dest = pkt->src;
            /* send response packet */
            post_office_send(response_mail, &err);
#ifdef DEBUG_LOG_START
           get_file_count_timer_gap = get_micro_sec() - get_file_count_timer_start;
#endif
          }
          if(fs_flash_power_on(false) != FS_STATUS_OK){
            NRF_LOG_INFO("Error in flash power on");
          }
          break;
      }

      case M2M2_FILE_SYS_CMD_GET_FILE_INFO_REQ: {
        FS_STATUS_ENUM_t fs_err_status = FS_STATUS_ERR;
        m2m2_file_sys_get_file_info_req_pkt_t *get_file_info_req = (m2m2_file_sys_get_file_info_req_pkt_t *)&pkt->data[0];
        /* Power On and mount flash memory */
        if(fs_flash_power_on(true) != FS_STATUS_OK) {
          response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_get_file_info_resp_pkt_t));
          if (response_mail != NULL) {
            m2m2_file_sys_get_file_info_resp_pkt_t *get_file_info_resp = (m2m2_file_sys_get_file_info_resp_pkt_t *)&response_mail->data[0];
            get_file_info_resp->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_CMD_GET_FILE_INFO_RESP;
            get_file_info_resp->status = (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_STATUS_ERROR;
            response_mail->src = pkt->dest;
            response_mail->dest = pkt->src;
            /* send response packet */
            post_office_send(response_mail, &err);
          }
        }else {
            response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_get_file_info_resp_pkt_t));
            if (response_mail != NULL) {
              m2m2_file_sys_get_file_info_resp_pkt_t *get_file_info_resp = (m2m2_file_sys_get_file_info_resp_pkt_t *)&response_mail->data[0];
              get_file_info_resp->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_CMD_GET_FILE_INFO_RESP;
              response_mail->src = pkt->dest;
              response_mail->dest = pkt->src;
              memset(&get_file_info_resp->file_name, 0, sizeof(get_file_info_resp->file_name));
              file_info_t get_file_info;
              /* get list files in directory */
              fs_err_status = fs_hal_get_file_info(&get_file_info_req->file_index, &get_file_info);
              if (fs_err_status != FS_STATUS_OK) {
                get_file_info_resp->status = fs_err_status;
              } else {
                get_file_info_resp->status = M2M2_FILE_SYS_STATUS_OK;
                memcpy(&get_file_info_resp->file_name,&get_file_info.file_name, sizeof(get_file_info_resp->file_name));
                get_file_info_resp->start_page = get_file_info.start_page;
                get_file_info_resp->end_page = get_file_info.end_page;
                get_file_info_resp->file_size = get_file_info.file_size;
              }
              post_office_send(response_mail, &err);
            }

          /* Power off Flash */
          if(fs_flash_power_on(false) != FS_STATUS_OK) {
            NRF_LOG_INFO("Error flash power on");
          }
        }
        break;
      }
#if 0
      case M2M2_FILE_SYS_CMD_PAGE_READ_TEST_REQ: {
        FS_STATUS_ENUM_t fs_err_status = FS_STATUS_ERR;
        m2m2_file_sys_page_read_test_req_pkt_t *page_read_test_req = (m2m2_file_sys_page_read_test_req_pkt_t *)&pkt->data[0];
        /* Power On and mount flash memory */
        if(fs_flash_power_on(true) != FS_STATUS_OK) {
          response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_page_read_test_resp_pkt_t));
          if (response_mail != NULL) {
            m2m2_file_sys_page_read_test_resp_pkt_t *page_test_resp = (m2m2_file_sys_page_read_test_resp_pkt_t *)&response_mail->data[0];
            page_test_resp->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_CMD_PAGE_READ_TEST_RESP;
            page_test_resp->status = (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_STATUS_ERROR;
            response_mail->src = pkt->dest;
            response_mail->dest = pkt->src;
            /* send response packet */
            post_office_send(response_mail, &err);
          }
        }else {
            response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_page_read_test_resp_pkt_t));
            if (response_mail != NULL) {
              m2m2_file_sys_page_read_test_resp_pkt_t *page_read_test_resp = (m2m2_file_sys_page_read_test_resp_pkt_t *)&response_mail->data[0];
              page_read_test_resp->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_CMD_PAGE_READ_TEST_RESP;
              response_mail->src = pkt->dest;
              response_mail->dest = pkt->src;
              page_read_test_resp->page_num = page_read_test_req->page_num;
              /* stream started */
              fs_stream_state = ADI_FS_STREAM_STARTED;

