ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/file_system_task.c
              /* read the data and spare area of a page */
              page_read_test_resp->num_bytes = page_read_test_req->num_bytes;
              fs_err_status = fs_hal_page_read_test(&page_read_test_req->page_num,page_read_test_resp,\
              page_read_test_req->num_bytes);
              if (fs_err_status != FS_STATUS_OK) {
                page_read_test_resp->status = fs_err_status;
              } else {
                page_read_test_resp->status = M2M2_FILE_SYS_STATUS_OK;
              }
              post_office_send(response_mail, &err);

               /* stream started */
              fs_stream_state = ADI_FS_STREAM_STOPPED;
            }

          /* Power off Flash */
          if(fs_flash_power_on(false) != FS_STATUS_OK) {
            NRF_LOG_INFO("Error flash power on");
          }
        }
        break;
      }
#endif
      case M2M2_FILE_SYS_CMD_LS_REQ: {
        FS_STATUS_ENUM_t fs_err_status = FS_STATUS_ERR;
        char file_dir[16];
        uint32_t FileSize = 0;
        uint8_t FileType = 0;
        snprintf(file_dir, 16, "%s\\", fs_hal_vol_name());
        /* Power On and mount flash memory */
        if(fs_flash_power_on(true) != FS_STATUS_OK) {
          response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_ls_resp_t));
          if (response_mail != NULL) {
            m2m2_file_sys_ls_resp_t *list_files_resp = (m2m2_file_sys_ls_resp_t *)&response_mail->data[0];
            list_files_resp->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_CMD_LS_RESP;
            list_files_resp->status = (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_STATUS_ERROR;
            response_mail->src = pkt->dest;
            response_mail->dest = pkt->src;
            /* send response packet */
            post_office_send(response_mail, &err);
          }
        }else {
          do {
            response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_ls_resp_t));
            if (response_mail != NULL) {
              m2m2_file_sys_ls_resp_t *list_files_resp = (m2m2_file_sys_ls_resp_t *)&response_mail->data[0];
              list_files_resp->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_CMD_LS_RESP;
              response_mail->src = pkt->dest;
              response_mail->dest = pkt->src;
              memset(&list_files_resp->full_file_name, 0, sizeof(list_files_resp->full_file_name));

              /* get list files in directory */
              fs_err_status = fs_hal_list_dir(file_dir, (char *)list_files_resp->full_file_name, \
                (sizeof(list_files_resp->full_file_name)), &FileType, &FileSize);
              if (fs_err_status != FS_STATUS_OK) {
                list_files_resp->filetype = M2M2_FILE_SYS_INVALID_TYPE;
                list_files_resp->filesize = 0;
                switch(fs_err_status) {
                case FS_STATUS_ERR_INVALID_DIR: {
                  list_files_resp->status = (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_ERR_INVALID;
                  break;
                } case FS_STATUS_ERR_EMPTY_DIR:
                case FS_STATUS_ERR_EOD:{
                  list_files_resp->status = (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_END_OF_DIR;
                  break;
                } default: {
                  list_files_resp->status = M2M2_FILE_SYS_STATUS_ERROR;
                  break;
                }
                }
              } else {
                list_files_resp->status = M2M2_FILE_SYS_STATUS_OK;
                list_files_resp->filetype = (FILE_TYPE_ENUM_t)FileType;
                list_files_resp->filesize = FileSize;
              }
              post_office_send(response_mail, &err);
            }
          } while(fs_err_status == FS_STATUS_OK);

          /* Power off Flash */
          if(fs_flash_power_on(false) != FS_STATUS_OK) {
            NRF_LOG_INFO("Error flash power on");
          }
        }
        break;
      }

      case M2M2_FILE_SYS_CMD_GET_BAD_BLOCKS_REQ: {
        response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_get_bad_blocks_cmd_t));
        if (response_mail != NULL) {
            m2m2_file_sys_get_bad_blocks_cmd_t *resp = (m2m2_file_sys_get_bad_blocks_cmd_t*)&response_mail->data[0];
            resp->command = M2M2_FILE_SYS_CMD_GET_BAD_BLOCKS_RESP;
            response_mail->src = pkt->dest;
            response_mail->dest = pkt->src;

            /* Power on Flash */
            if(fs_flash_power_on(true) != FS_STATUS_OK) {
              NRF_LOG_INFO("Error flash power on");
            }

            /* Get bad blocks number */
            uint32_t bad_blocks;
            if( LFS_SUCCESS != get_bad_block(&bad_blocks)) {
              resp->bad_blocks = bad_blocks;
              resp->status = (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_APP_COMMON_STATUS_ERROR;
            } else {
              resp->bad_blocks = 0;
              resp->status =  (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_APP_COMMON_STATUS_OK;
            }
            /* Send subscription packet */
            post_office_send(response_mail, &err);

 /* Power off Flash */
            if(fs_flash_power_on(false) != FS_STATUS_OK) {
              NRF_LOG_INFO("Error flash power off");
            }
        }
        break;
      }

      case M2M2_FILE_SYS_CMD_DOWNLOAD_LOG_REQ: {
        if(fs_stream_state != ADI_FS_STREAM_STARTED) {
#ifdef PROFILE_TIME_ENABLED
          usb_avg_tx_time = 0;
          num_bytes_transferred = 0;
          avg_file_read_time = 0;
          num_times_read = 0;
          usb_min_cdc_time = 4,294,967,295;
          usb_max_cdc_time = 0;
          usb_min_tx_time= 4,294,967,295;
          usb_max_tx_time = 0;
          max_num_of_retries = 0;
          total_time_taken_512_bytes_transfer = 0;
#endif
#ifdef PAGE_READ_DEBUG_INFO
          /* reset variables */
          last_page_read = 0;
          last_page_read_offset = 0;
          last_page_read_status = 0;
          num_bytes_transferred = 0;
          bytes_processed_from_fs_task = 0;
          usb_cdc_write_failed = 0;
#endif
          memset(&fs_stream.file_path,0,sizeof(fs_stream.file_path));
          m2m2_file_sys_get_req_t *get_file_req = (m2m2_file_sys_get_req_t *)&pkt->data[0];
          /* Copy file name global path */
          snprintf(fs_stream.file_path, ((pkt->length - M2M2_HEADER_SZ - 1)) , \
            "%s", get_file_req->file_name);
          memset(&get_file_req->file_name, 0,
                 pkt->length - (M2M2_HEADER_SZ + \
                   sizeof(m2m2_file_sys_get_req_t) - 1));
          /* Power On and mount flash memory */
          if(fs_flash_power_on(true) != FS_STATUS_OK) {
            response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_cmd_t));
            if (response_mail != NULL) {
              m2m2_file_sys_cmd_t *err_resp = (m2m2_file_sys_cmd_t *)&response_mail->data[0];
              err_resp->command = M2M2_FILE_SYS_CMD_DOWNLOAD_LOG_RESP;
              err_resp->status = M2M2_FILE_SYS_STATUS_ERROR;
              response_mail->src = pkt->dest;
              response_mail->dest = pkt->src;
              /* send response packet */
              post_office_send(response_mail, &err);
            }
          } else {
            fs_stream.fs_buffer_size = sizeof(fs_stream.file_buff);
            fs_stream.processed_data_len = 0;
            fs_stream.current_page_number = 0;
            fs_stream.file_start_page_number = 0;
            fs_stream.page_chunk_number = 0;
            setFsDownloadFlag(0);
            fs_download_chunk_cnt = 0;
            /* Open file for reading data */
            fs_stream.fs_err_status = fs_hal_read_file(fs_stream.file_path,
                                                       &fs_stream.file_buff[0],
                                                       &fs_stream.fs_buffer_size,&fs_stream.current_page_number);
            fs_status_stored = fs_stream.fs_err_status;
            if(((fs_stream.fs_err_status == FS_STATUS_OK)
                                             || (fs_stream.fs_err_status == FS_STATUS_ERR_EOF))
                                             && (FileStreamSubsciberCount == 0)){
              fs_stream.num_bytes_left = fs_stream.fs_buffer_size;
              fs_stream.file_start_page_number = fs_stream.current_page_number;
              fs_stream.pkt_src = pkt->src;
              fs_stream.pkt_dest = pkt->dest;
              /*Check if DOWNLOAD_LOG is requested by external Tool Entity*/
              if((pkt->src >= M2M2_ADDR_APP_DROID) && (pkt->src <= M2M2_ADDR_APP_CLI_BLE))
                gsFsDownloadReqByExtTool = 1;
              FileStreamSubsciberCount++;
              /* Subscribe to mailbox */
              m2m2_hdr_t *sub_pkt = post_office_create_msg(M2M2_HEADER_SZ + sizeof(post_office_config_t));
              if(sub_pkt != NULL) {
                post_office_config_t *payload = (post_office_config_t *)&sub_pkt->data;
                payload->cmd = POST_OFFICE_CFG_CMD_MAILBOX_SUBSCRIBE;
                payload->sub = pkt->src;
                payload->box = M2M2_ADDR_SYS_FS_STREAM;
                sub_pkt->src = pkt->dest;
                sub_pkt->dest = M2M2_ADDR_POST_OFFICE;
                post_office_send(sub_pkt, &err);
              }
              fs_stream_state = ADI_FS_STREAM_STARTED;
              timeout = ADI_OSAL_TIMEOUT_NONE;
              nSeqNum = 0;
              /* clear variables for new file download */
              num_bytes_processed = 0;
              fs_download_total_pkt_cnt = 0;
              total_packet_cnt_transferred = 0;

#ifdef NAND_READ_TEST
             // g_file_read_time = 0;
             // g_file_read_cnt = 0;
#endif //NAND_READ_TEST
            } else {

