ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/file_system_task.c
              response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_cmd_t));
              if (response_mail != NULL) {
                m2m2_file_sys_cmd_t *err_resp = (m2m2_file_sys_cmd_t *)&response_mail->data[0];
                err_resp->command = M2M2_FILE_SYS_CMD_DOWNLOAD_LOG_RESP;
                err_resp->status = M2M2_FILE_SYS_STATUS_ERROR;
                response_mail->src = pkt->dest;
                response_mail->dest = pkt->src;
                /* send response packet */
                post_office_send(response_mail, &err);
              }
            }
          }
         }
        break;
      }
      case M2M2_FILE_SYS_CMD_LOG_STREAM_REQ : {
        m2m2_file_sys_log_stream_t *subscribe_req = (m2m2_file_sys_log_stream_t*)&pkt->data[0];
        response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_log_stream_t));
        if (response_mail != NULL) {
          m2m2_file_sys_log_stream_t *req = (m2m2_file_sys_log_stream_t*)&response_mail->data[0];
          /* Check for destination of stream */
          response_mail->dest = get_file_routing_table_entry(subscribe_req->stream);
          if (response_mail->dest == M2M2_ADDR_UNDEFINED) {
            req->command = M2M2_FILE_SYS_CMD_LOG_STREAM_RESP;
            req->status = M2M2_FILE_SYS_STATUS_ERROR;
            req->stream = subscribe_req->stream;
            response_mail->dest = pkt->src;
            response_mail->src = pkt->dest;
            SubsGlobalSrc = M2M2_ADDR_UNDEFINED;
            /* Send response packet */
            post_office_send(response_mail, &err);
          } else {
            /* Send subscription request to PS */
            SubsGlobalSrc = pkt->src;
            req->command = M2M2_APP_COMMON_CMD_STREAM_SUBSCRIBE_REQ;
            req->status =  (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_APP_COMMON_STATUS_OK;
            req->stream = subscribe_req->stream;
            response_mail->src = pkt->dest;
            /* Send subscription packet */
            post_office_send(response_mail, &err);
          }
        }
        break;
      } case M2M2_APP_COMMON_CMD_STREAM_SUBSCRIBE_RESP: {
        int16_t Table_Index;
        m2m2_file_sys_log_stream_t *p_payload = (m2m2_file_sys_log_stream_t*)&pkt->data[0];
        response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_log_stream_t));
        if (response_mail != NULL) {
          m2m2_file_sys_log_stream_t *resp = (m2m2_file_sys_log_stream_t*)&response_mail->data[0];
          /* Update FS table subscription status */
          Table_Index = get_file_routing_table_index(p_payload->stream);
          if(Table_Index != -1)
            file_routing_table[Table_Index].fs_subs_state = M2M2_FILE_SYS_SUBSCRIBED;
          /* Send response to APP */
          resp->command = M2M2_FILE_SYS_CMD_LOG_STREAM_RESP;
          if (p_payload->status == M2M2_APP_COMMON_STATUS_SUBSCRIBER_ADDED) {
            resp->status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_ADDED;
            NRF_LOG_INFO("status = %d",resp->status);
          } else {
            resp->status = M2M2_FILE_SYS_STATUS_ERROR;
          }
          resp->stream = p_payload->stream;
          response_mail->dest = SubsGlobalSrc;
          response_mail->src = pkt->dest;
          SubsGlobalSrc = M2M2_ADDR_UNDEFINED;
          /* Send response packet */
          post_office_send(response_mail, &err);
        }
        break;
      } case M2M2_FILE_SYS_CMD_STOP_STREAM_REQ : {
        m2m2_file_sys_log_stream_t *req_payload= (m2m2_file_sys_log_stream_t*)&pkt->data[0];
        response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_log_stream_t));
        if (response_mail != NULL) {
          m2m2_file_sys_log_stream_t *resp_payload = (m2m2_file_sys_log_stream_t*)&response_mail->data[0];
          response_mail->dest = get_file_routing_table_entry(req_payload->stream);
          if (response_mail->dest != M2M2_ADDR_UNDEFINED) {
            /* Send stream unsubscribe request */
            SubsGlobalSrc = pkt->src;
            resp_payload->command = M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_REQ;
            resp_payload->status =  (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_APP_COMMON_STATUS_OK;
          } else {
            /* Send error resp */
            resp_payload->command = M2M2_FILE_SYS_CMD_STOP_STREAM_RESP;
            resp_payload->status =  M2M2_FILE_SYS_STATUS_ERROR;
            response_mail->dest = pkt->src;
          }
          /* Send response packet */
          resp_payload->stream = req_payload->stream;
          response_mail->src = pkt->dest;
          post_office_send(response_mail, &err);
        }
        break;
      }case M2M2_FILE_SYS_CMD_APPEND_FILE_REQ : {
        FS_STATUS_ENUM_t ret;

         /* open previous file handler and assign it to global array */
         ret = fs_hal_append_file();
         if( ret != FS_STATUS_OK)  {
          if(ret == FS_STATUS_NO_FILE_TO_APPEND_ERROR)  {

            /* allow create new file , reset flag */
            file_append = false;

            /* assign file src */
            FileSrc = pkt->src;

            /* assign flag to skip set of flag */
            append_req=1;

            appended_status = (M2M2_FILE_SYS_STATUS_ENUM_t)M2M2_FILE_SYS_STATUS_OK;

              /* send command to file system task to create file */
              response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
              if (response_mail != NULL) {
                _m2m2_app_common_cmd_t *file_stream_start_resp = (_m2m2_app_common_cmd_t *)&response_mail->data[0];
                file_stream_start_resp->command = M2M2_FILE_SYS_CMD_START_LOGGING_REQ;
                file_stream_start_resp->status = M2M2_FILE_SYS_STATUS_OK;

                /* send response packet */
                response_mail->src = M2M2_ADDR_SYS_FS;
                response_mail->dest = M2M2_ADDR_SYS_FS;
                post_office_send(response_mail, &err);
              }

            /* response is broken , so that response is given from start logging request */
            break;
          }
          else  {
            appended_status = (M2M2_FILE_SYS_STATUS_ENUM_t)M2M2_FILE_SYS_STATUS_ERROR;
          }
         }
         else  {
          /* allow previous file to append */
          file_append = true;
          appended_status = (M2M2_FILE_SYS_STATUS_ENUM_t)M2M2_FILE_SYS_STATUS_OK;

          /* variables required for logging */

