ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/file_system_task.c
          /* update file source for destination address */
	  FileSrc = pkt->src;

          /* file header write made false for stream write */
         file_hdr_wr_progress = false;

          /* set appropriate write mode */
          set_write_handler_mode();
#ifdef ENABLE_WATCH_DISPLAY
          /* reset variables to track counters for logging */
          min_timer_cnt = fs_display_query_cnt = 0;
#ifdef LOW_TOUCH_FEATURE
          if(!get_low_touch_trigger_mode3_status())
#endif
            reset_display_vol_info();
#ifdef CUST4_SM
          else
            reset_display_vol_info1();
#endif
           //Update the NAND memory progress bar in Main menu page of Display
           send_private_type_value(DIS_REFRESH_SIGNAL);
#endif
         }

        /* send response to source back */
        m2m2_file_sys_cmd_t *req_payload= (m2m2_file_sys_cmd_t*)&pkt->data[0];
        response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_cmd_t));
        if (response_mail != NULL) {
            m2m2_file_sys_cmd_t *resp_payload = (m2m2_file_sys_cmd_t*)&response_mail->data[0];
            response_mail->dest = pkt->src;
            response_mail->src = pkt->dest;
            resp_payload->command = M2M2_FILE_SYS_CMD_APPEND_FILE_RESP;
            resp_payload->status = appended_status;
            post_office_send(response_mail, &err);
        }
        break;
      }case M2M2_FILE_SYS_CMD_GET_IMPT_DEBUG_INFO_REQ : {
        response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_debug_impt_info_resp_t));
        if (response_mail != NULL) {
          /* flash power on */
          if(fs_flash_power_on(true) != FS_STATUS_OK){
              NRF_LOG_INFO("Error in flash power on");
          }
          m2m2_file_sys_debug_impt_info_resp_t *resp_payload = (m2m2_file_sys_debug_impt_info_resp_t*)&response_mail->data[0];
          uint32_t head_pointer;
          uint32_t tail_pointer;
          uint16_t table_page_flags[MAX_NUM_OF_VARIABLES_IN_TABLE_PAGE];
          memset(table_page_flags,0,MAX_NUM_OF_VARIABLES_IN_TABLE_PAGE);
          if(get_pointers_info(&head_pointer,&tail_pointer,table_page_flags) != 0) {
            resp_payload->head_pointer = 0;
            resp_payload->tail_pointer = 0;
            resp_payload->tail_pointer = 0;
            resp_payload->init_circular_buffer_flag = 0;
            resp_payload->mem_full_flag = 0;
            resp_payload->data_offset = 0;
            resp_payload->config_file_occupied = 0;
            resp_payload->status =  M2M2_FILE_SYS_STATUS_ERROR;
          } else {
            resp_payload->head_pointer = head_pointer;
            resp_payload->tail_pointer = tail_pointer;
            resp_payload->init_circular_buffer_flag = table_page_flags[0];
            resp_payload->mem_full_flag = table_page_flags[1];
            resp_payload->data_offset = table_page_flags[2];
            resp_payload->config_file_occupied = table_page_flags[3];
          }
#ifdef ENABLE_WATCH_DISPLAY
           resp_payload->fs_display_query_cnt = fs_display_query_cnt;
           resp_payload->min_timer_cnt = min_timer_cnt;
#else
           resp_payload->fs_display_query_cnt = 0;
           resp_payload->min_timer_cnt = 0;
#endif
#ifdef PROFILE_TIME_ENABLED
          resp_payload->page_read_time = avg_file_read_time;
          resp_payload->usb_avg_tx_time = usb_avg_tx_time;
          resp_payload->usb_avg_port_write_time = usb_avg_cdc_write_time;
          resp_payload->page_write_time = g_page_hold_write_time;
#else
          resp_payload->usb_avg_tx_time = 0;
          resp_payload->usb_avg_port_write_time = 0;
          resp_payload->page_read_time = 0;
          resp_payload->page_write_time = 0;
#endif

          /* Send response packet */
          resp_payload->command = M2M2_FILE_SYS_CMD_GET_IMPT_DEBUG_INFO_RESP;
          resp_payload->status = (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_APP_COMMON_STATUS_OK;
          response_mail->dest = pkt->src;
          response_mail->src = pkt->dest;
          post_office_send(response_mail, &err);
          /* flash power on */
          if(fs_flash_power_on(false) != FS_STATUS_OK){
           NRF_LOG_INFO("Error in flash power off");
          }
        }
        break;
      }case M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_RESP : {
        int16_t Table_Index;
        m2m2_file_sys_log_stream_t *p_payload = (m2m2_file_sys_log_stream_t*)&pkt->data[0];
        response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_log_stream_t));
        if (response_mail != NULL) {
          m2m2_file_sys_log_stream_t *resp_payload = (m2m2_file_sys_log_stream_t*)&response_mail->data[0];
            /* Update FS table for unsubscription */
            Table_Index = get_file_routing_table_index(p_payload->stream);
            if(Table_Index != -1)
              file_routing_table[Table_Index].fs_subs_state = M2M2_FILE_SYS_UNSUBSCRIBED;
            if(SubsGlobalSrc != M2M2_ADDR_SYS_FS) {
              /* Send response to APP */
              resp_payload->command = M2M2_FILE_SYS_CMD_STOP_STREAM_RESP;
              if (p_payload->status == M2M2_APP_COMMON_STATUS_SUBSCRIBER_REMOVED){
                resp_payload->status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_REMOVED;
               }
               else if(p_payload->status == M2M2_APP_COMMON_STATUS_SUBSCRIBER_COUNT_DECREMENT) {
                  resp_payload->status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_COUNT_DECREMENT;
                } else {
                  resp_payload->status = M2M2_FILE_SYS_STATUS_ERROR;
                }
              response_mail->dest = SubsGlobalSrc;
            } else {
              /* Send Force stop log req */
              resp_payload->command = M2M2_FILE_SYS_CMD_STOP_LOGGING_REQ;
              resp_payload->status = M2M2_FILE_SYS_STATUS_OK;
              response_mail->dest = M2M2_ADDR_SYS_FS;
            }
            /* Send response packet */
            resp_payload->stream = p_payload->stream;
            response_mail->src = pkt->dest;
            SubsGlobalSrc = M2M2_ADDR_UNDEFINED;
            post_office_send(response_mail, &err);
        }
        break;
      } case M2M2_FILE_SYS_CMD_DELETE_CONFIG_FILE_REQ: {
        FS_STATUS_ENUM_t fs_err_status = FS_STATUS_ERR;
        response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_cmd_t));
        if (response_mail != NULL) {
          m2m2_file_sys_cmd_t *file_stream_start_resp = (m2m2_file_sys_cmd_t *)&response_mail->data[0];
          /* if file writing in progress, do not delete config file, */
          if(fs_hal_write_access_state() != FS_FILE_ACCESS_IN_PROGRESS) {
            fs_flash_power_on(true);
            /* Check if config file already exist,
            if so delete it to update the new one */
            fs_err_status = fs_hal_delete_config_file(ConfigFileName, sizeof(ConfigFileName));
            file_stream_start_resp->command = M2M2_FILE_SYS_CMD_DELETE_CONFIG_FILE_RESP;
            if(fs_err_status == FS_STATUS_ERR){
              file_stream_start_resp->status = (M2M2_FILE_SYS_STATUS_ENUM_t)M2M2_FILE_SYS_STATUS_ERROR;
            }
            else if(fs_err_status == FS_STATUS_OK){
              file_stream_start_resp->status = (M2M2_FILE_SYS_STATUS_ENUM_t) M2M2_FILE_SYS_STATUS_OK;
            }
            else if(fs_err_status == FS_STATUS_ERR_CONFIG_FILE_NOT_FOUND){
              file_stream_start_resp->status = (M2M2_FILE_SYS_STATUS_ENUM_t) M2M2_FILE_SYS_CONFIG_FILE_NOT_FOUND;
            }
            fs_flash_power_on(false);
#ifdef LOW_TOUCH_FEATURE
            /*update the config file availability flag*/
            SetCfgFileAvailableFlag(false);
            NRF_LOG_INFO("LT NAND User Cfg file deleted");
            if( check_lt_app_capsense_tuned_trigger_status() )  {
              if (!gen_blk_get_dcb_present_flag() && !gsCfgFileFoundFlag)
                EnableLowTouchDetection(false);
            }
#endif
           }
           /* send logging in progress */
           else{
            file_stream_start_resp->command = M2M2_FILE_SYS_CMD_DELETE_CONFIG_FILE_RESP;
            file_stream_start_resp->status = M2M2_FILE_SYS_STATUS_LOGGING_IN_PROGRESS;
           }
            /* send response packet */
            response_mail->src = pkt->dest;
            response_mail->dest = pkt->src;
            post_office_send(response_mail, &err);
          }
        break;
      }
#ifdef LOW_TOUCH_FEATURE
      case M2M2_FILE_SYS_CMD_FORCE_STOP_LOG_REQ: {
        FS_STATUS_ENUM_t fs_error;

        if(FileSrc != M2M2_ADDR_UNDEFINED) {
          /* Send stream stop request */
          fs_unsubscribe_streams();
            /* Stop File logging */
            fs_error = fs_hal_close_file(fs_hal_write_file_pointer());
            if(fs_error == FS_STATUS_OK) {
              fs_flash_power_on(false);
            /* Create Response packet */
            response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
            if(response_mail != NULL) {
              _m2m2_app_common_cmd_t *resp_payload = (_m2m2_app_common_cmd_t *)&response_mail->data[0];
              response_mail->src = M2M2_ADDR_SYS_FS;
              if(gSendRespToPmApp) {
                gSendRespToPmApp = 0;
                response_mail->dest = M2M2_ADDR_SYS_PM;
              } else {
                response_mail->dest = FileSrc;
              }
              resp_payload->command = M2M2_FILE_SYS_CMD_FORCE_STOP_LOG_RESP;
              if(fs_error == FS_STATUS_OK) {
                FileSrc = M2M2_ADDR_UNDEFINED;
                if(gMemoryFull == true) {
                  gMemoryFull = false;
                  resp_payload->status = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_ERR_MEMORY_FULL;
                } else {
                  resp_payload->status = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_ERR_LOG_FORCE_STOPPED;
                }
              } else {
                resp_payload->status = M2M2_APP_COMMON_STATUS_ERROR;
              }
              /* send response packet */
              post_office_send(response_mail, &err);
            }
            /*error handling for closing file which is not proper */
          }
        } else {
          /* Send log not started response */
          response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
          if(response_mail != NULL) {
            _m2m2_app_common_cmd_t *resp_payload = (_m2m2_app_common_cmd_t *)&response_mail->data[0];
            resp_payload->command = M2M2_FILE_SYS_CMD_FORCE_STOP_LOG_RESP;
            response_mail->src = pkt->dest;
            response_mail->dest = pkt->src;
            resp_payload->status = M2M2_APP_COMMON_STATUS_STREAM_NOT_STARTED;
            /* send response packet */
            post_office_send(response_mail, &err);
          }
        }
        break;
      }
#endif
      case M2M2_FILE_SYS_CMD_DCFG_START_LOG_REQ: {
        uint8_t cfgFileFoundFlag=0;
        FS_STATUS_ENUM_t fs_err_status = FS_STATUS_ERR;
        response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_cmd_t));
        if (response_mail != NULL) {
            m2m2_file_sys_cmd_t *file_stream_start_resp = (m2m2_file_sys_cmd_t *)&response_mail->data[0];
            file_stream_start_resp->command = M2M2_FILE_SYS_CMD_DCFG_START_LOG_RESP;
            if(fs_hal_write_access_state() == FS_FILE_ACCESS_IN_PROGRESS) {
              /* send file is accessed send in progress status */
              file_stream_start_resp->status = M2M2_FILE_SYS_STATUS_LOGGING_IN_PROGRESS;
            }
          else{
              /* power on only if flash operations are required */
              fs_flash_power_on(true);
              /* find if config file is found, if yes return error */
              fs_hal_find_config_file(ConfigFileName, sizeof(ConfigFileName),0, &cfgFileFoundFlag);
              if(cfgFileFoundFlag){
                /* config file is found, hence cannot create new config file */
                file_stream_start_resp->status = (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_CONFIG_FILE_FOUND;
              }
                /* if config file is not present create new config file */
              else{
                 /* create the new config file */
                  fs_err_status = fs_hal_open_config_file(ConfigFileName);

                  switch(fs_err_status) {
                    case FS_STATUS_OK: {
                      file_stream_start_resp->status = (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_STATUS_OK;
                    break;
                    } case FS_STATUS_ERR_INVALID_DIR: {
                      file_stream_start_resp->status = (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_ERR_INVALID;
                      break;
                    } case FS_STATUS_ERR_CONFIG_FILE_POSITION: {
                      file_stream_start_resp->status = (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_ERR_CONFIG_FILE_POSITION;
                      break;
                    }default: {
                      file_stream_start_resp->status = M2M2_FILE_SYS_STATUS_ERROR;
                      break;
                    }
                  }
                }
              /* power off */
              fs_flash_power_on(false);
            }
            /* send response packet */
            response_mail->src = pkt->dest;
            response_mail->dest = pkt->src;
            post_office_send(response_mail, &err);
        }
        break;
      } case M2M2_FILE_SYS_CMD_DCFG_STOP_LOG_REQ: {
        FS_STATUS_ENUM_t fs_err_status = FS_STATUS_ERR;
        response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_cmd_t));
        if (response_mail != NULL) {
          m2m2_file_sys_cmd_t *file_stream_stop_resp = (m2m2_file_sys_cmd_t *)&response_mail->data[0];
          file_stream_stop_resp->command = M2M2_FILE_SYS_CMD_DCFG_STOP_LOG_RESP;
          if(fs_hal_write_access_state() == FS_FILE_ACCESS_IN_PROGRESS){
              fs_err_status = fs_hal_close_file(fs_hal_write_file_pointer());
              if (fs_err_status == FS_STATUS_OK) {
                file_stream_stop_resp->status = M2M2_FILE_SYS_STATUS_OK;
                FileSrc = M2M2_ADDR_UNDEFINED;
#ifdef LOW_TOUCH_FEATURE
                /*update the config file copy availability flag*/
                SetCfgCopyAvailableFlag(false);
                /*update the config file availability flag*/
                SetCfgFileAvailableFlag(true);
                NRF_LOG_INFO("LT NAND User Cfg file written");
                if( check_lt_app_capsense_tuned_trigger_status() )
                {
                  EnableLowTouchDetection(true);
                }
#endif
              } else {
                file_stream_stop_resp->status = M2M2_FILE_SYS_STATUS_ERROR;
              }
          } else {
            file_stream_stop_resp->status = M2M2_FILE_SYS_ERR_INVALID;
          }
          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          post_office_send(response_mail, &err);

          /* Power off Flash */
          fs_flash_power_on(false);
        }
        break;
      } case M2M2_FILE_SYS_CMD_LOG_USER_CONFIG_DATA_REQ: {
          M2M2_APP_COMMON_STATUS_ENUM_t fs_err_status ;
          uint32_t  len_configdata = 0;
          uint8_t configdata_buffer[70];
          m2m2_file_sys_user_config_data *config_data = (m2m2_file_sys_user_config_data*)&pkt->data[0];
          len_configdata = config_data->len_configstream;
          memset(configdata_buffer, 0x00, sizeof(configdata_buffer));
          memcpy(&configdata_buffer[0], &config_data->byte_configstream, len_configdata);
          if(fs_hal_write_access_state() == FS_FILE_ACCESS_IN_PROGRESS) {
            fs_err_status = (M2M2_APP_COMMON_STATUS_ENUM_t)fs_hal_test_pattern_config_write(configdata_buffer, len_configdata);
          }else {
            fs_err_status = (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_STATUS_ERROR;
          }
          response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
          if (response_mail != NULL) {
            _m2m2_app_common_cmd_t  *ctrl = (_m2m2_app_common_cmd_t *)&response_mail->data[0];
            ctrl->command = M2M2_FILE_SYS_CMD_LOG_USER_CONFIG_DATA_RESP;
            if(fs_err_status != (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_ERR_MEMORY_FULL){
              ctrl->status = fs_err_status;
            } else {
              ctrl->status = (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_STATUS_OK;
            }
            response_mail->dest = pkt->src;
            response_mail->src =  pkt->dest;
            post_office_send(response_mail, &err);
          }
          break;
      } case M2M2_FILE_SYS_CMD_START_LOGGING_REQ: {
        FS_STATUS_ENUM_t fs_err_status = FS_STATUS_ERR;
        m_time_struct  *local_get_date_time;
        char caTime[7] = { 0 };
        char date[9] = { 0 };
        uint8_t nIndex = 0;
        char fname[40];
        uint8_t nFileCount=0;
        gnadpd_dcfg_tx_PacketCount = 0;

