ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/file_system_task.c
        /* Power On and mount flash memory */
        if(fs_flash_power_on(true) != FS_STATUS_OK) {
          response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_cmd_t));
          if (response_mail != NULL) {
            m2m2_file_sys_cmd_t *resp_payload = (m2m2_file_sys_cmd_t *)&response_mail->data[0];
            resp_payload->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_CMD_LS_RESP;
            resp_payload->status = (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_STATUS_ERROR;
            response_mail->src = pkt->dest;
            response_mail->dest = pkt->src;
            /* send response packet */
            post_office_send(response_mail, &err);
          }
        } else {
          if(fs_hal_write_access_state() == FS_FILE_ACCESS_START) {
#ifdef HIBERNATE_MD_EN
            hibernate_md_clear(HIB_MD_FS_LOG_STOP_EVT);
            hibernate_mode_entry();
#endif
            /* Create file and start logging */
            file_hdr_wr_progress = true;

            /* create a file in write mode */
            if(file_append == false)  {
              /* Generate file name from RTC Time */
              time_t return_time;
              int16_t timezone_offset;

              fs_err_status = fs_hal_get_file_count(&nFileCount);
              if( (fs_err_status == FS_STATUS_OK) && (nFileCount >= (MAXFILENUMBER-1)) )
                fs_err_status = FS_STATUS_ERR_MAX_FILE_COUNT;

              if(fs_err_status == FS_STATUS_OK) {
                /*reintialize the status variable*/
                fs_err_status = FS_STATUS_ERR;
                if( !get_log_time_stamp(&return_time, &timezone_offset)) {
                  /* For file name creation timezone_offset is not required */
                  local_get_date_time = m_sec_to_date_time(return_time + timezone_offset);
                  do {
                    snprintf(caTime, sizeof(caTime), "%2u%2u%2u", local_get_date_time->tm_hour,
                            local_get_date_time->tm_min,nFileCount+1);
                   /* set spaces to zeros */
                   while (caTime[nIndex] != '\0') {
                     if (caTime[nIndex] == ' ') {
                       caTime[nIndex] = '0';
                     }
                     nIndex++;
                   }
                   nIndex = 0;
                   snprintf(date, sizeof(date), "%1X%2X%5X",
                           local_get_date_time->tm_mon, local_get_date_time->tm_mday, atoi(caTime));
                   local_get_date_time->tm_sec++;
                   if (local_get_date_time->tm_sec > 59) {
                     local_get_date_time->tm_sec = 0;
                     local_get_date_time->tm_min++;
                     if(local_get_date_time->tm_min > 59) {
                       local_get_date_time->tm_min = 0;
                       local_get_date_time->tm_hour++;
                       if (local_get_date_time->tm_hour > 23) {
                         local_get_date_time->tm_hour = 0;
                         /* handled upto valid time values */
                       }
                     }
                   }
                   /* set spaces to zeros */
                   while (date[nIndex] != '\0') {
                     if (date[nIndex] == ' ') {
                       date[nIndex] = '0';
                     }
                     nIndex++;
                    }
                    nIndex = 0;
                    snprintf(fname, sizeof(fname), "%s.LOG\0",&date[0]);
                    fs_err_status = fs_hal_find_file(fname);
                  } while(fs_err_status == FS_STATUS_OK);
                } else {
                      /* use default file name if file name could not be generated */
                      snprintf(fname, sizeof(fname), "%s\\NANDDFLT.LOG", fs_hal_vol_name());
                  }
                fs_err_status = fs_hal_open_file(fname);
              }
              if (fs_err_status != FS_STATUS_OK) {
                /* Send response for log start */
                response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_cmd_t));
                if (response_mail != NULL) {
                  m2m2_file_sys_cmd_t *file_stream_start_resp = (m2m2_file_sys_cmd_t *)&response_mail->data[0];
                  file_stream_start_resp->command = M2M2_FILE_SYS_CMD_START_LOGGING_RESP;

                  switch(fs_err_status) {
                  case FS_STATUS_ERR_MAX_FILE_COUNT: {
                    file_stream_start_resp->status = M2M2_FILE_SYS_ERR_MAX_FILE_COUNT;
                    break;
                  }
                  case FS_STATUS_ERR_CONFIG_FILE_POSITION: {
                    file_stream_start_resp->status = M2M2_FILE_SYS_ERR_CONFIG_FILE_POSITION;
                    break;
                 }
                 case FS_STATUS_ERR_INVALID_DIR: {
                   file_stream_start_resp->status = M2M2_FILE_SYS_ERR_INVALID;
                   break;
                 }
                 default: {
                   file_stream_start_resp->status = M2M2_FILE_SYS_STATUS_ERROR;
                   break;
                 }
                }
                /* send response packet */
                response_mail->src = pkt->dest;
                response_mail->dest = pkt->src;
                post_office_send(response_mail, &err);
              }
            } else {
              if(append_req != 1) {
                FileSrc = pkt->src;
              }

#ifdef USER0_CONFIG_APP
              uint16_t exp_id = 0;
              uint8_t exp_id_str[16] = "\0";
              /* Read exp_id: from user0 config DCB first,
                 if it doesnt exist read from fw lcfg */
              if( (get_id_num(USER0_CONFIG_LCFG_EXP_ID, &exp_id)==GET_ID_FAILURE) ) {
                get_id_num_fw_lcfg(&exp_id);
              }
              //If experiment id is Valid(ie from 1-9999 range)
              if(exp_id != 0){
                //Update the g_userinfo structure
                m_time_struct *local_get_date_time;
                time_t return_time;
                int16_t timezone_offset;

                get_log_time_stamp(&return_time, &timezone_offset);
                local_get_date_time = m_sec_to_date_time(return_time + timezone_offset);//For file getDateTime timezone_offset IS required
                sprintf(exp_id_str,"%d", exp_id);
                memcpy(&g_userinfo.valueID[0], (void *)&exp_id_str,sizeof(g_userinfo.valueID));
                g_userinfo.keyID = M2M2_KEY_ID;
                g_userinfo.year = local_get_date_time->tm_year;
                g_userinfo.month = local_get_date_time->tm_mon;
                g_userinfo.day = local_get_date_time->tm_mday;
                g_userinfo.hour = local_get_date_time->tm_hour;
                g_userinfo.minute = local_get_date_time->tm_min;
                g_userinfo.second = local_get_date_time->tm_sec;
                g_userinfo.TZ_sec = timezone_offset;
#else
              if((g_userinfo.keyID != M2M2_DEFAULT_KEY_ID)){
#endif
                /* Create Key Value pair packet */
                response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_set_key_value_pair_resp_t));
                if (response_mail != NULL) {
                  m2m2_file_sys_set_key_value_pair_resp_t *payloadUserinfo = (m2m2_file_sys_set_key_value_pair_resp_t *)&response_mail->data[0];
                  memcpy(payloadUserinfo,(void *)&g_userinfo, sizeof(m2m2_file_sys_set_key_value_pair_resp_t));
                  payloadUserinfo->command = (M2M2_FILE_SYS_CMD_ENUM_t) M2M2_FILE_SYS_CMD_SET_KEY_VALUE_PAIR_RESP;
                  payloadUserinfo->status = M2M2_FILE_SYS_STATUS_OK;
                  response_mail->src = pkt->dest;
                  response_mail->dest = pkt->src;

                  /* 1 - Write Key Value Pair to Flash */
                  if (fs_hal_write_packet_stream(response_mail) != M2M2_APP_COMMON_STATUS_OK) {
                    /* Send Error response if write to Flash fails */
                    fs_send_write_error(&FileSrc);
                  }
                  post_office_consume_msg(response_mail);
                }
              }//if(exp_id != 0) or if((g_userinfo.keyID != M2M2_DEFAULT_KEY_ID))

              /* 2 - Request PM Date and time Information */
              response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
              if (response_mail != NULL) {
                _m2m2_app_common_cmd_t *get_datetime_req = (_m2m2_app_common_cmd_t *)&response_mail->data[0];
                get_datetime_req->command = (M2M2_APP_COMMON_CMD_ENUM_t) M2M2_PM_SYS_COMMAND_GET_DATE_TIME_REQ;
                get_datetime_req->status = M2M2_APP_COMMON_STATUS_OK;
                /* send response packet */
                response_mail->src = M2M2_ADDR_SYS_FS;
                response_mail->dest = M2M2_ADDR_SYS_PM;
                post_office_send(response_mail, &err);
              }

