ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/file_system_task.c
#ifdef ENABLE_WATCH_DISPLAY
              /* reset variables to track counters for logging */
              min_timer_cnt = fs_display_query_cnt = 0;
#ifdef LOW_TOUCH_FEATURE
              if(!get_low_touch_trigger_mode3_status())
#endif
                reset_display_vol_info();
#ifdef CUST4_SM
              else
                reset_display_vol_info1();
#endif
              //Update the NAND memory progress bar in Main menu page of Display
              send_private_type_value(DIS_REFRESH_SIGNAL);
#endif
            }//else for if (fs_err_status != FS_STATUS_OK)
            }//if(file_append == false)
          } else { //else of if(fs_hal_write_access_state() == FS_FILE_ACCESS_START)
                /* Send Error response as logging is already in progress */
                response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
                if (response_mail != NULL) {
                  _m2m2_app_common_cmd_t *file_stream_start_resp = (_m2m2_app_common_cmd_t *)&response_mail->data[0];
                  file_stream_start_resp->command = M2M2_FILE_SYS_CMD_START_LOGGING_RESP;
                  file_stream_start_resp->status = M2M2_FILE_SYS_STATUS_LOGGING_IN_PROGRESS;
                  /* send response packet */
                  response_mail->src = pkt->dest;
                  response_mail->dest = pkt->src;
                  post_office_send(response_mail, &err);
                }
          }
        }//else of if(fs_flash_power_on(true) != FS_STATUS_OK)
        break;
      }
      /* Resp for Date time req(step2) */
      case M2M2_PM_SYS_COMMAND_GET_DATE_TIME_RESP: {
        if (fs_hal_write_packet_stream(pkt) != M2M2_APP_COMMON_STATUS_OK) {
          /* Send Error response if write to Flash fails */
          fs_send_write_error(&FileSrc);
          file_hdr_wr_progress = true;
        } else {
            /* 3 - request PM system info */
            response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
            if (response_mail != NULL) {
              _m2m2_app_common_cmd_t *get_pm_sysinfo_req = (_m2m2_app_common_cmd_t *)&response_mail->data[0];
              get_pm_sysinfo_req->command = (M2M2_APP_COMMON_CMD_ENUM_t) M2M2_PM_SYS_COMMAND_GET_INFO_REQ;
              get_pm_sysinfo_req->status = M2M2_APP_COMMON_STATUS_OK;
              /* send response packet */
              response_mail->src = M2M2_ADDR_SYS_FS;
              response_mail->dest = M2M2_ADDR_SYS_PM;
              post_office_send(response_mail, &err);
            }
        }
        break;
      }
      /* Response for PM system info req(step3) */
      case M2M2_PM_SYS_COMMAND_GET_INFO_RESP: {
        if (fs_hal_write_packet_stream(pkt) != M2M2_APP_COMMON_STATUS_OK) {
          /* Send Error response if write to Flash fails */
          fs_send_write_error(&FileSrc);
          file_hdr_wr_progress = true;
        } else {
          /* 4 - request PM version Information */
          response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_app_common_version_t));
          if (response_mail != NULL) {
            m2m2_app_common_version_t *version_num_req = (m2m2_app_common_version_t *)&response_mail->data[0];
            version_num_req->command = M2M2_APP_COMMON_CMD_GET_VERSION_REQ;
            version_num_req->status = M2M2_APP_COMMON_STATUS_OK;
            /* send response packet */
            response_mail->src = M2M2_ADDR_SYS_FS;
            response_mail->dest = M2M2_ADDR_SYS_PM;
            post_office_send(response_mail, &err);
          }
        }
        break;
      }
      //Response for Get Version info(step 4 & 5)
      case M2M2_APP_COMMON_CMD_GET_VERSION_RESP: {
        /* Response for Version info req(step 4) */
        if (pkt->src == M2M2_ADDR_SYS_PM) {
          if (fs_hal_write_packet_stream(pkt) != M2M2_APP_COMMON_STATUS_OK) {
            /* Send Error response if write to Flash fails */
            fs_send_write_error(&FileSrc);
            file_hdr_wr_progress = true;
          } else {
#ifdef ENABLE_PPG_APP
          response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
          if (response_mail != NULL) {
              /* 6 - request PPG Algo version */
            _m2m2_app_common_cmd_t *algo_version = (_m2m2_app_common_cmd_t *)&response_mail->data[0];
            algo_version->command = M2M2_PPG_APP_CMD_GET_ALGO_VENDOR_VERSION_REQ;
            response_mail->dest = M2M2_ADDR_MED_PPG;
            algo_version->status = M2M2_APP_COMMON_STATUS_OK;
            /* send response packet */
             response_mail->src = M2M2_ADDR_SYS_FS;
             post_office_send(response_mail, &err);
            }
          }
        }
        break;
      }
      /* Response for PPG Algo request(step 6) */
      case M2M2_PPG_APP_CMD_GET_ALGO_VENDOR_VERSION_RESP: {
        if (fs_hal_write_packet_stream(pkt) != M2M2_APP_COMMON_STATUS_OK) {
          /* Send Error response if write to Flash fails */
          fs_send_write_error(&FileSrc);
          file_hdr_wr_progress = true;
        } else {
#endif
#ifdef ENABLE_PEDO_APP
          /* 7 - request PED Algo version */
          response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
          if (response_mail != NULL) {
            _m2m2_app_common_cmd_t *algo_version = (_m2m2_app_common_cmd_t *)&response_mail->data[0];
            algo_version->command = M2M2_PED_APP_CMD_GET_ALGO_VENDOR_VERSION_REQ;
            algo_version->status = M2M2_APP_COMMON_STATUS_OK;
            /* send response packet */
            response_mail->src = M2M2_ADDR_SYS_FS;
            response_mail->dest = M2M2_ADDR_MED_PED;
            post_office_send(response_mail, &err);
          }
        }
#ifndef ENABLE_PPG_APP
      }
#endif
      break;
    }
      /* Response for PED Algo request(step 7) */
      case M2M2_PED_APP_CMD_GET_ALGO_VENDOR_VERSION_RESP: {
        if (fs_hal_write_packet_stream(pkt) != M2M2_APP_COMMON_STATUS_OK) {
          /* Send Error response if write to Flash fails */
          fs_send_write_error(&FileSrc);
          file_hdr_wr_progress = true;
        } else {
#endif
#ifdef ENABLE_ECG_APP
          /* 8 - request ECG Algo version */
          response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
          if (response_mail != NULL) {
            _m2m2_app_common_cmd_t *algo_version = (_m2m2_app_common_cmd_t *)&response_mail->data[0];
            algo_version->command = M2M2_ECG_APP_CMD_GET_ALGO_VENDOR_VERSION_REQ;
            algo_version->status = M2M2_APP_COMMON_STATUS_OK;
            /* send response packet */
            response_mail->src = M2M2_ADDR_SYS_FS;
            response_mail->dest = M2M2_ADDR_MED_ECG;
            post_office_send(response_mail, &err);
          }
        }
#if !defined(ENABLE_PPG_APP) && !defined(ENABLE_PEDO_APP)
       }
#endif
        break;
      }
      /* Response for ECG Algo request(step 8) */
      case M2M2_ECG_APP_CMD_GET_ALGO_VENDOR_VERSION_RESP: {
        if (fs_hal_write_packet_stream(pkt) != M2M2_APP_COMMON_STATUS_OK) {
          /* Send Error response if write to Flash fails */
          fs_send_write_error(&FileSrc);
          file_hdr_wr_progress = true;
        } else {
#endif
#ifdef ENABLE_SQI_APP
          /* 9 - request SQI Algo version */
          response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
          if (response_mail != NULL) {
            _m2m2_app_common_cmd_t *algo_version = (_m2m2_app_common_cmd_t *)&response_mail->data[0];
            algo_version->command = M2M2_SQI_APP_CMD_GET_ALGO_VENDOR_VERSION_REQ;
            algo_version->status = M2M2_APP_COMMON_STATUS_OK;
            /* send response packet */
            response_mail->src = M2M2_ADDR_SYS_FS;
            response_mail->dest = M2M2_ADDR_MED_SQI;
            post_office_send(response_mail, &err);
          }
        }
#if !defined(ENABLE_PPG_APP) && !defined(ENABLE_PEDO_APP) && !defined(ENABLE_ECG_APP)
       }
#endif
        break;
      }
      /* Response for SQI Algo request(step 9) */
      case M2M2_SQI_APP_CMD_GET_ALGO_VENDOR_VERSION_RESP: {
        if (fs_hal_write_packet_stream(pkt) != M2M2_APP_COMMON_STATUS_OK) {
          /* Send Error response if write to Flash fails */
          fs_send_write_error(&FileSrc);
          file_hdr_wr_progress = true;
        } else {
#endif
          /* 10 - request ADPD DCFG */
          response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_cmd_t));
          if (response_mail != NULL) {
            m2m2_file_sys_cmd_t *dcfg_req = (m2m2_file_sys_cmd_t *)&response_mail->data[0];

            if((get_address_sub_state(M2M2_ADDR_SENSOR_ADPD4000) == M2M2_FILE_SYS_SUBSCRIBED) ||
               (get_address_sub_state(M2M2_ADDR_MED_PPG) == M2M2_FILE_SYS_SUBSCRIBED)){
                 dcfg_req->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_SENSOR_COMMON_CMD_GET_DCFG_REQ;
                 response_mail->dest = M2M2_ADDR_SENSOR_ADPD4000;
                 response_mail->src = M2M2_ADDR_SYS_FS;
               } else {
                 /* Send Duplicate response to FS itself if ADPD is
                    not subscribed to go to step 10 */
                 dcfg_req->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_SENSOR_COMMON_CMD_GET_DCFG_RESP;
                 response_mail->dest = M2M2_ADDR_SYS_FS;
                 response_mail->src = M2M2_ADDR_SENSOR_ADPD4000;
               }
            dcfg_req->status = M2M2_APP_COMMON_STATUS_OK;
            /* send response packet */
            post_office_send(response_mail, &err);
          }
        }
#if !defined(ENABLE_PPG_APP) && !defined(ENABLE_PEDO_APP) && !defined(ENABLE_ECG_APP) && !defined(ENABLE_SQI_APP)
       }
#endif
        break;
      }
      /* Response to ADPD and ADXL DCFG req(step 9 & 10) */
      case M2M2_SENSOR_COMMON_CMD_GET_DCFG_RESP: {
        if (pkt->src == M2M2_ADDR_SENSOR_ADPD4000) {
          /*if TX packets from ADPD DCFG more than 1 wait for the next ADPD DCFG packet*/
          if (pkt->length > sizeof(m2m2_sensor_dcfg_data_t)) { // To avoid dummy reuest from FS
            m2m2_sensor_dcfg_data_t *dcfg_data_req = (m2m2_sensor_dcfg_data_t *)&pkt->data[0];
            if(gnadpd_dcfg_tx_PacketCount == 0)
              gnadpd_dcfg_tx_PacketCount = dcfg_data_req->num_tx_pkts;
          }
          M2M2_APP_COMMON_STATUS_ENUM_t err_status = M2M2_APP_COMMON_STATUS_OK;
          if ((get_address_sub_state(pkt->src) == M2M2_FILE_SYS_SUBSCRIBED) ||
              (get_address_sub_state(M2M2_ADDR_MED_PPG) == M2M2_FILE_SYS_SUBSCRIBED)) {
                err_status = fs_hal_write_packet_stream(pkt);
            }
          if (err_status != M2M2_APP_COMMON_STATUS_OK) {
            /* Send Error response if write to Flash fails */
            fs_send_write_error(&FileSrc);
            file_hdr_wr_progress = true;
          } else {
            /* 10 - request ADXL DCFG */
            if(gnadpd_dcfg_tx_PacketCount > 0)
              --gnadpd_dcfg_tx_PacketCount;
            if(gnadpd_dcfg_tx_PacketCount == 0) {// send ADXL DCFG request once the ADPD DCFG tx packets received
              response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_cmd_t));
              if (response_mail != NULL) {
                m2m2_file_sys_cmd_t *dcfg_req = (m2m2_file_sys_cmd_t *)&response_mail->data[0];
                if((get_address_sub_state(M2M2_ADDR_SENSOR_ADXL) == M2M2_FILE_SYS_SUBSCRIBED) ||
                   (get_address_sub_state(M2M2_ADDR_MED_PPG) == M2M2_FILE_SYS_SUBSCRIBED)){
                     dcfg_req->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_SENSOR_COMMON_CMD_GET_DCFG_REQ;
                     response_mail->dest = M2M2_ADDR_SENSOR_ADXL;
                     response_mail->src = M2M2_ADDR_SYS_FS;
                   } else {
                     /* Send duplicate response to FS itself
                        if ADXL is not subscribed to go to step 11 */
                     dcfg_req->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_SENSOR_COMMON_CMD_GET_DCFG_RESP;
                     response_mail->dest = M2M2_ADDR_SYS_FS;
                     response_mail->src = M2M2_ADDR_SENSOR_ADXL;
                   }
                dcfg_req->status = M2M2_APP_COMMON_STATUS_OK;
                post_office_send(response_mail, &err);
              }
            }
          }
        } else if (pkt->src == M2M2_ADDR_SENSOR_ADXL) {
          M2M2_APP_COMMON_STATUS_ENUM_t err_status = M2M2_APP_COMMON_STATUS_OK;
          if ((get_address_sub_state(pkt->src) == M2M2_FILE_SYS_SUBSCRIBED) ||
              (get_address_sub_state(M2M2_ADDR_MED_PPG) == M2M2_FILE_SYS_SUBSCRIBED)) {
                err_status = fs_hal_write_packet_stream(pkt);
          }
          if (err_status != M2M2_APP_COMMON_STATUS_OK) {
            /* Send Error response if write to Flash fails */
            fs_send_write_error(&FileSrc);
            file_hdr_wr_progress = true;
          } else {
#ifdef ENABLE_PPG_APP
            /* 11 - request PPG LCFG */
            response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_cmd_t));
            if (response_mail != NULL) {
              m2m2_file_sys_cmd_t *lcfg_req = (m2m2_file_sys_cmd_t *)&response_mail->data[0];
              if(get_address_sub_state(M2M2_ADDR_MED_PPG) == M2M2_FILE_SYS_SUBSCRIBED) {
                lcfg_req->command = M2M2_APP_COMMON_CMD_GET_LCFG_REQ;
                response_mail->dest = M2M2_ADDR_MED_PPG;
                response_mail->src = M2M2_ADDR_SYS_FS;
              } else {
                /* Send duplicate response to FS itself
                   if PPG is not subscribed to go to step 12 */
                lcfg_req->command = M2M2_APP_COMMON_CMD_GET_LCFG_RESP;
                response_mail->dest = M2M2_ADDR_SYS_FS;
                response_mail->src = M2M2_ADDR_MED_PPG;
              }
              lcfg_req->status = M2M2_APP_COMMON_STATUS_OK;
              post_office_send(response_mail, &err);
            }
          }
        }
        break;
      }
      /* Response for PPG LCFG request(step 11) */
      case M2M2_APP_COMMON_CMD_GET_LCFG_RESP: {
        if (pkt->src == M2M2_ADDR_MED_PPG) {
          M2M2_APP_COMMON_STATUS_ENUM_t err_status = M2M2_APP_COMMON_STATUS_OK;
          if (get_address_sub_state(pkt->src) == M2M2_FILE_SYS_SUBSCRIBED) {
            err_status = fs_hal_write_packet_stream(pkt);
          }
          if (err_status != M2M2_APP_COMMON_STATUS_OK) {
            /* Send Error response if write to flash fails */
            fs_send_write_error(&FileSrc);
            file_hdr_wr_progress = true;
          } else {
#endif
#ifdef ENABLE_ECG_APP
            /* 12 - request ECG LCFG */
            response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(ecg_app_lcfg_op_hdr_t) + FS_ECG_APP_MAX_LCFG_OPS * sizeof(ecg_app_lcfg_op_t));
            if (response_mail != NULL) {
              uint8_t field = 0;
              ecg_app_lcfg_op_hdr_t *lcfgecg_read_req = (ecg_app_lcfg_op_hdr_t *)&response_mail->data[0];
              if(get_address_sub_state(M2M2_ADDR_MED_ECG) == M2M2_FILE_SYS_SUBSCRIBED) {
                lcfgecg_read_req->num_ops = FS_ECG_APP_MAX_LCFG_OPS;
                for (int i = 0; i < lcfgecg_read_req->num_ops; i++) {
                  lcfgecg_read_req->ops[i].field = field++;
                  lcfgecg_read_req->ops[i].value = 0;
                }
                lcfgecg_read_req->command = (M2M2_APP_COMMON_CMD_ENUM_t) M2M2_APP_COMMON_CMD_READ_LCFG_REQ;
                response_mail->dest = M2M2_ADDR_MED_ECG;
                response_mail->src = M2M2_ADDR_SYS_FS;
              } else {
                /* Send duplicate response to FS itself
                    if ECG is not subscribed to go to step 13 */
                lcfgecg_read_req->command = (M2M2_APP_COMMON_CMD_ENUM_t) M2M2_APP_COMMON_CMD_READ_LCFG_RESP;
                response_mail->dest = M2M2_ADDR_SYS_FS;
                response_mail->src = M2M2_ADDR_MED_ECG;
              }
              lcfgecg_read_req->status = M2M2_APP_COMMON_STATUS_OK;
              /* send response packet */
              post_office_send(response_mail, &err);
              }
          }
        }
        break;
      }
      /* Response for ECG LCFG request(step 12) */
      case M2M2_APP_COMMON_CMD_READ_LCFG_RESP: {
        if (pkt->src == M2M2_ADDR_MED_ECG) {
          M2M2_APP_COMMON_STATUS_ENUM_t err_status = M2M2_APP_COMMON_STATUS_OK;
          if (get_address_sub_state(pkt->src) == M2M2_FILE_SYS_SUBSCRIBED) {
            err_status = fs_hal_write_packet_stream(pkt);
          }
          if (err_status != M2M2_APP_COMMON_STATUS_OK) {
            /* Send Error response if write to Flash fails */
            fs_send_write_error(&FileSrc);
            file_hdr_wr_progress = true;
          } else {
#endif

