ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/file_system_task.c
            response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_cmd_t));
            if (response_mail != NULL) {
              m2m2_file_sys_cmd_t *resp_payload= (m2m2_file_sys_cmd_t*)&response_mail->data[0];

              file_hdr_wr_progress = false;
              if(append_req) {
                resp_payload->command = M2M2_FILE_SYS_CMD_APPEND_FILE_RESP;
                resp_payload->status = appended_status;
                /* clear flag */
                append_req = 0;
              } else {
                resp_payload->command = M2M2_FILE_SYS_CMD_START_LOGGING_RESP;
                resp_payload->status = M2M2_FILE_SYS_STATUS_OK;
              }
              response_mail->src = pkt->dest;
              response_mail->dest = FileSrc;
              post_office_send(response_mail, &err);
            }
#ifdef DEBUG_LOG_START
            start_log_timer_gap = get_micro_sec() -  start_log_timer_start;
#endif
#ifdef ENABLE_WATCH_DISPLAY
            /* reset variables to track counters for logging */
            min_timer_cnt = fs_display_query_cnt = 0;
#endif
          }//else of if(err_status != M2M2_APP_COMMON_STATUS_OK)
        }
        break;
      }
       case M2M2_FILE_SYS_BLOCKS_WRITE_REQ: {
#ifdef PATTERN_WRITE_ENABLED
       m2m2_file_sys_write_blocks_t *write_blocks_req = (m2m2_file_sys_write_blocks_t *)&pkt->data[0];
       uint16_t start_block_num;
       uint16_t num_blocks_write;
       static uint8_t first_time_write=1;
        response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
        if (response_mail != NULL) {
          _m2m2_app_common_cmd_t *resp = (_m2m2_app_common_cmd_t*)&response_mail->data[0];
          resp->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_BLOCKS_WRITE_RESP;
          /* Copy start block and end block no */
           num_blocks_write = write_blocks_req->num_blocks_write;
           start_block_num = write_blocks_req->start_block_num;
          if(fs_flash_power_on(true) != FS_STATUS_OK) {
                NRF_LOG_INFO("Flash power on error");
                resp->status = M2M2_FILE_SYS_STATUS_BLOCKS_WRITE_ERROR;
          } else {
             for(int i = 0; i < num_blocks_write; i++) {
              for(int j = 0; j < PAGES_PER_BLOCK; j++) {
                  memset(pArr,0,sizeof(pArr));
                  InitTestBuffer(pArr, sizeof(pArr));
                  /* write blocks */
                  if(fs_hal_write_blocks(pArr,start_block_num,PAGE_SIZE,first_time_write) == FS_STATUS_OK){
                    resp->status |= M2M2_FILE_SYS_STATUS_OK;
                  }else {
                    resp->status |= M2M2_FILE_SYS_STATUS_BLOCKS_WRITE_ERROR;
                }
                first_time_write = 0;
              }
            }
          }
          response_mail->dest = pkt->src;
          response_mail->src = pkt->dest;
          post_office_send(response_mail, &err);
        }
        if(fs_flash_power_on(false) != FS_STATUS_OK){
            NRF_LOG_INFO("Flash power off error");
          }
#endif
        break;
      }
      case M2M2_FILE_SYS_CMD_GET_FS_STATUS_REQ : {
        g_fs_status_reps_tick = get_sensor_time_stamp();
        response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
        if (response_mail != NULL) {
          _m2m2_app_common_cmd_t *resp = (_m2m2_app_common_cmd_t*)&response_mail->data[0];
          resp->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_CMD_GET_FS_STATUS_RESP;
          if (FileSrc != M2M2_ADDR_UNDEFINED) {
            resp->status = M2M2_FILE_SYS_STATUS_LOGGING_IN_PROGRESS;
          }else {
            resp->status = M2M2_FILE_SYS_STATUS_LOGGING_NOT_STARTED;
          }
          response_mail->dest = pkt->src;
          response_mail->src = pkt->dest;
          post_office_send(response_mail, &err);
        }
        break;
      } case M2M2_FILE_SYS_CMD_GET_FS_STREAM_SUB_STATUS_REQ : {
        M2M2_ADDR_ENUM_t TempAdress;
        int16_t Table_Index;
        m2m2_app_common_sub_op_t *subs_status_req = (m2m2_app_common_sub_op_t*)&pkt->data[0];
        response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_get_subs_status_resp_t));
        if (response_mail != NULL) {
          m2m2_file_sys_get_subs_status_resp_t *resp = (m2m2_file_sys_get_subs_status_resp_t*)&response_mail->data[0];
          resp->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_CMD_GET_FS_STREAM_SUB_STATUS_RESP;
          TempAdress = get_file_routing_table_entry(subs_status_req->stream);
          if (TempAdress != M2M2_ADDR_UNDEFINED) {
            resp->status = (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_STATUS_OK;
            Table_Index = get_file_routing_table_index(subs_status_req->stream);
            resp->stream = subs_status_req->stream;
            if(Table_Index != -1)
              resp->subs_state = file_routing_table[Table_Index].fs_subs_state;
          } else {
            resp->status = (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_STATUS_ERROR;
            resp->stream = subs_status_req->stream;
            resp->subs_state = M2M2_FILE_SYS_SUBS_INVALID;
          }
          response_mail->dest = pkt->src;
          response_mail->src = pkt->dest;
          post_office_send(response_mail, &err);
#ifdef DEBUG_LOG_START
           fs_sub_timer_gap = get_micro_sec() - fs_sub_timer_start;
#endif
        }
        break;
      }
      case M2M2_FILE_SYS_CMD_TEST_LOG_REQ: {
      FS_STATUS_ENUM_t fs_error;
#ifdef PATTERN_WRITE_ENABLED
        InitTestBuffer(pArr, sizeof(pArr));
        /* power on flash */
        if(fs_flash_power_on(true) != FS_STATUS_OK) {
           NRF_LOG_INFO("Flash power on error");
         }
         if(fs_hal_write_access_state() == FS_FILE_ACCESS_START) {
          /* Create file and start logging */
            file_hdr_wr_progress = true;
            /* open file name */
            fs_error = fs_hal_open_file(PatternFileName);
             response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_cmd_t));
            if (response_mail != NULL) {
              m2m2_file_sys_cmd_t  *ctrl = (m2m2_file_sys_cmd_t *)&response_mail->data[0];
              ctrl->command = M2M2_FILE_SYS_CMD_TEST_LOG_RESP;
              if(fs_error != FS_STATUS_OK) {
                ctrl->status = M2M2_APP_COMMON_STATUS_ERROR;
              }
              else {
                ctrl->status = M2M2_APP_COMMON_STATUS_OK;
              }
                response_mail->dest = pkt->src;
                response_mail->src =  pkt->dest;
                post_office_send(response_mail, &err);
            }

#ifdef NAND_WRITE_TEST
            g_file_write_time = 0;
#endif
            if (fs_error == FS_STATUS_OK) {
            for (gs2kChunkCnt=0; gs2kChunkCnt < ADI_FS_FILE_MAX_SIZE; gs2kChunkCnt++)
            {
#ifdef NAND_WRITE_TEST
              nTick = MCU_HAL_GetTick();
#endif
              fs_error |= fs_hal_test_pattern_write(pArr, sizeof(pArr));

#ifdef NAND_WRITE_TEST
            g_write_time = (MCU_HAL_GetTick() - nTick);
            g_file_write_time += g_write_time;
            NRF_LOG_INFO("Write time for a page = %d",g_write_time);
#endif
          }
        }
#ifdef NAND_WRITE_TEST
          NRF_LOG_INFO("Write time for %d pages = %d",ADI_FS_FILE_MAX_SIZE,g_file_write_time);
         NRF_LOG_INFO("***** Average pattern file write time=%d***********",(g_file_write_time/ADI_FS_FILE_MAX_SIZE));
#endif
       }
	if(fs_hal_write_access_state() == FS_FILE_ACCESS_IN_PROGRESS){
          fs_error = fs_hal_close_file(fs_hal_write_file_pointer());
          if(fs_error == FS_STATUS_OK) {
            //flash power off
          if(fs_flash_power_on(false) != FS_STATUS_OK){
              NRF_LOG_INFO("Flash power off error");
          }
            file_hdr_wr_progress = false;
          }
        }
#endif /* PATTERN_WRITE_ENABLED */
        break;
      }
      case M2M2_FILE_SYS_CMD_PATTERN_WRITE_REQ: {
#ifdef PATTERN_WRITE_ENABLED
      FS_STATUS_ENUM_t fs_error;
      uint32_t num_pages_to_write;
      char Filename[16];
      uint8_t nFileCount;
      m2m2_file_sys_pattern_write_req_pkt_t *pattern_write_req = (m2m2_file_sys_pattern_write_req_pkt_t*)&pkt->data[0];
        M2M2_FILE_SYS_STATUS_ENUM_t fs_err_open_status = (M2M2_FILE_SYS_STATUS_ENUM_t)M2M2_FILE_SYS_STATUS_ERROR;
        InitTestBuffer(pArr, sizeof(pArr));
        for(uint32_t nIndex = 0; nIndex < 4;nIndex++){
          NRF_LOG_INFO("%d",pArr[ nIndex]);
        }
        /* power on flash */
        if(fs_flash_power_on(true) != FS_STATUS_OK) {
           NRF_LOG_INFO("Flash power on error");
         }

         if(fs_hal_write_access_state() == FS_FILE_ACCESS_START) {
          /* Create file and start logging */
            file_hdr_wr_progress = true;
            fs_error = fs_hal_get_file_count(&nFileCount);
            /* create new file */
            snprintf(Filename,16,"%s_%d",PatternFileName,(nFileCount+1));
            /* dont create file if file size less than page size */
            if(pattern_write_req->file_size >= PAGE_SIZE) {
              /* open file name */
              fs_error = fs_hal_open_file(Filename);
              num_pages_to_write = (pattern_write_req->file_size/PAGE_SIZE);

