ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/file_system_task.c
              /* file opening error */
              if(fs_error != FS_STATUS_OK)  {
                if(fs_error == FS_STATUS_ERR_MAX_FILE_COUNT)  {
                  fs_err_open_status = M2M2_FILE_SYS_ERR_MAX_FILE_COUNT;
                }
                else if(fs_error == FS_STATUS_ERR_CONFIG_FILE_POSITION) {
                  fs_err_open_status = M2M2_FILE_SYS_ERR_CONFIG_FILE_POSITION;
                }
                else if(fs_error == FS_STATUS_ERR_MEMORY_FULL)  {
                  fs_err_open_status =  (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_ERR_MEMORY_FULL;
                }
               else  {
                 fs_err_open_status = M2M2_FILE_SYS_STATUS_ERROR;
                }
              }
              else {
                fs_err_open_status = FS_STATUS_OK;
              }
#ifdef NAND_WRITE_TEST
            g_file_write_time=0;
#endif
              /* write if creation of file is successful */
              if (fs_error == FS_STATUS_OK) {
                /* set file src to valid , for display to progress bar */
                FileSrc = pkt->src;

#ifdef ENABLE_WATCH_DISPLAY
#ifdef LOW_TOUCH_FEATURE
                if(!get_low_touch_trigger_mode3_status())
#endif
                  reset_display_vol_info();
#ifdef CUST4_SM
                else
                  reset_display_vol_info1();
#endif
                //Update the NAND memory progress bar in Main menu page of Display
                send_private_type_value(DIS_REFRESH_SIGNAL);
#endif

                for (gs2kChunkCnt = 0; gs2kChunkCnt < num_pages_to_write; gs2kChunkCnt++) {
#ifdef NAND_WRITE_TEST
                  nTick = MCU_HAL_GetTick();
#endif
                  fs_error |= fs_hal_test_pattern_write(pArr, sizeof(pArr));
                  /* process errors */
                  if(fs_error == (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_ERR_MEMORY_FULL){
                    break;
                  }
#ifdef NAND_WRITE_TEST
                  g_write_time = (MCU_HAL_GetTick() - nTick);
                  g_file_write_time += g_write_time;
                  NRF_LOG_INFO("Write time for a page = %d",g_write_time);
#endif
                }
              }
            }
           else  {
              NRF_LOG_INFO("pattern write wont create file less than page size");
              fs_error = FS_STATUS_ERR;
          }
          response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_cmd_t));
          if (response_mail != NULL) {
            m2m2_file_sys_cmd_t  *ctrl = (m2m2_file_sys_cmd_t *)&response_mail->data[0];
            ctrl->command = M2M2_FILE_SYS_CMD_PATTERN_WRITE_RESP;
            if(fs_err_open_status != FS_STATUS_OK)  {
              /* failure in creation of file */
              ctrl->status = fs_err_open_status;
            }
            else  {
              /* process write errors */
              if(fs_error ==  (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_ERR_MEMORY_FULL){
                /* send memory full */
                ctrl->status  = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_ERR_MEMORY_FULL;
              }
              else if(fs_error != FS_STATUS_OK){
                ctrl->status = fs_error;
              }
              else {
                ctrl->status = FS_STATUS_OK;
              }
            }

            response_mail->dest = pkt->src;
            response_mail->src =  pkt->dest;
            post_office_send(response_mail, &err);
          }
#ifdef NAND_WRITE_TEST
         NRF_LOG_INFO("Write time for %d pages = %d",ADI_FS_FILE_MAX_SIZE,g_file_write_time);
         NRF_LOG_INFO("***** Average pattern file write time=%d***********",(g_file_write_time/ADI_FS_FILE_MAX_SIZE));
#endif
       }
	if(fs_hal_write_access_state() == FS_FILE_ACCESS_IN_PROGRESS){
          fs_error = fs_hal_close_file(fs_hal_write_file_pointer());
          if(fs_error == FS_STATUS_OK) {
            /* flash power off */
            if(fs_flash_power_on(false) != FS_STATUS_OK){
                NRF_LOG_INFO("Flash power off error");
            }
            file_hdr_wr_progress = false;
          }
        }
            /* update file src */
            FileSrc = M2M2_ADDR_UNDEFINED;
#ifdef ENABLE_WATCH_DISPLAY
#ifdef LOW_TOUCH_FEATURE
            if(!get_low_touch_trigger_mode3_status())
#endif
              reset_display_vol_info();
#ifdef CUST4_SM
            else
              reset_display_vol_info1();
#endif
            //Update the NAND memory progress bar in Main menu page of Display
            send_private_type_value(DIS_REFRESH_SIGNAL);
#endif

#endif /* PATTERN_WRITE_ENABLED */
        break;
      }
      case M2M2_FILE_SYS_CMD_CANCEL_DOWNLOAD_LOG_REQ: {
        response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
        if (response_mail != NULL) {
          _m2m2_app_common_cmd_t *file_stream_stop_resp = (_m2m2_app_common_cmd_t *)&response_mail->data[0];
          file_stream_stop_resp->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_CMD_STOP_FS_STREAM_RESP;
           fs_stream_usubscribe();
           fs_stream.pkt_src = M2M2_ADDR_UNDEFINED;
           fs_stream.pkt_dest = M2M2_ADDR_UNDEFINED;
           fs_stream_state = ADI_FS_STREAM_STOPPED;
           revert_fs_prio();
           timeout = ADI_OSAL_TIMEOUT_FOREVER;
           file_stream_stop_resp->status = M2M2_FILE_SYS_STATUS_OK;

          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          post_office_send(response_mail, &err);
        }
        break;
      }
      case M2M2_FILE_SYS_CMD_GET_FS_DEBUG_INFO_REQ: {
        m2m2_file_sys_debug_info_req_t *payload = (m2m2_file_sys_debug_info_req_t*)&pkt->data[0];
        response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_debug_info_resp_t));
        if(response_mail != NULL) {
          m2m2_file_sys_debug_info_resp_t *resp_payload = (m2m2_file_sys_debug_info_resp_t *)&response_mail->data[0];
          resp_payload->command = M2M2_FILE_SYS_CMD_GET_FS_DEBUG_INFO_RESP;
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          resp_payload->status = M2M2_FILE_SYS_STATUS_OK;
          resp_payload->stream = payload->stream;
          get_file_misd_packet_debug_info(resp_payload);
          /* send response packet */
          post_office_send(response_mail, &err);
        }
        break;
      }
#if 0
      case M2M2_FILE_SYS_CMD_FILE_READ_TEST_REQ: {
        m2m2_file_sys_sample_data_file_read_req_t *payload = (m2m2_file_sys_sample_data_file_read_req_t*)&pkt->data[0];
         /* Flash power on */
        if(fs_flash_power_on(true) != FS_STATUS_OK) {
             response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_sample_data_file_read_resp_t));
              if(response_mail != NULL) {
                m2m2_file_sys_sample_data_file_read_resp_t *resp_payload = (m2m2_file_sys_sample_data_file_read_resp_t *)&response_mail->data[0];
                resp_payload->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_CMD_FILE_READ_TEST_RESP;
                response_mail->src = pkt->dest;
                response_mail->dest = pkt->src;
                resp_payload->status = (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_STATUS_ERROR;
                /* send error response packet */
                post_office_send(response_mail, &err);
              }
          }
          else {
            m2m2_file_sys_page_read_test_resp_pkt_t page_read_test_info;
            M2M2_APP_COMMON_STATUS_ENUM_t fs_err_status = FS_STATUS_OK;
            uint16_t data_offset=0;
            uint16_t page_offset=0;
            memset(pArr,0,PAGE_SIZE);
            for (int i=payload->start_page_ind;i <= payload->end_page_ind;i++)  {
                memset(&page_read_test_info,0,sizeof(page_read_test_info));
                fs_err_status |= fs_hal_page_read_test(&i,&page_read_test_info,MAX_NUM_OF_BYTES_FOR_PAGE_READ_TEST);
                if (fs_err_status != FS_STATUS_OK) {
                    break;
                }

                /* clear pointer after every page read */
                page_offset = 0;
                int j;

                for(j=data_offset;j < (data_offset+MAX_NUM_OF_BYTES_FOR_PAGE_READ_TEST);j++)  {
                  pArr[j] = page_read_test_info.sample_data[page_offset++];
                }

                /* append a delimiter */
                pArr[j] = DELIMITER;

                data_offset += (MAX_NUM_OF_BYTES_FOR_PAGE_READ_TEST+sizeof(DELIMITER));
                if(data_offset == MAX_NUM_OF_DOUBLE_PAGE_READ)  {
                  response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_sample_data_file_read_resp_t));
                  if(response_mail == NULL) {
                    NRF_LOG_INFO("Wait for memory to get allocated");

                    MCU_HAL_Delay(50);

