ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/file_system_task.c
                    i--;/* stay in same page as no memory is allocated */
                  }
                  else  {
                    m2m2_file_sys_sample_data_file_read_resp_t *resp_payload = (m2m2_file_sys_sample_data_file_read_resp_t *)&response_mail->data[0];
                    resp_payload->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_CMD_FILE_READ_TEST_RESP;
                    response_mail->src = pkt->dest;
                    response_mail->dest = pkt->src;
                    if(fs_err_status == FS_STATUS_OK)  {
                      resp_payload->status = (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_STATUS_OK;
                    }
                    else {
                      resp_payload->status = fs_err_status;
                    }

                   // hike_fs_prio();
                    timeout = ADI_OSAL_TIMEOUT_NONE;
                    fs_stream_state = ADI_FS_STREAM_STARTED;

                    /* copy data */
                    memcpy(resp_payload->sample_data,pArr,MAX_NUM_OF_DOUBLE_PAGE_READ);

                    /* send response packet */
                    post_office_send(response_mail, &err);

                    while(get_usbd_tx_pending_status())  {
                      MCU_HAL_Delay(1);
                    }
                    /*clear parray*/
                    memset(pArr,0,MAX_NUM_OF_DOUBLE_PAGE_READ);
                    data_offset = 0;
                  }
		}
		else  {
                  /* if data offset is less than 500 bytes , only few bytes left and in last page , then as well send */
                  if(i == payload->end_page_ind)  {
                    response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_sample_data_file_read_resp_t));
                    if(response_mail == NULL) {
                      NRF_LOG_INFO("Wait for memory to get allocated");

                      MCU_HAL_Delay(50);
                      i--;/* stay in same page as no memory is allocated */
                    }
                    else  {
                      m2m2_file_sys_sample_data_file_read_resp_t *resp_payload = (m2m2_file_sys_sample_data_file_read_resp_t *)&response_mail->data[0];
                      resp_payload->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_CMD_FILE_READ_TEST_RESP;
                      response_mail->src = pkt->dest;
                      response_mail->dest = pkt->src;

                      if(fs_err_status == FS_STATUS_OK)
                        resp_payload->status = (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_STATUS_OK;

                      /* copy data */
                      memcpy(resp_payload->sample_data,pArr,MAX_NUM_OF_SINGLE_PAGE_READ);

                      /* send response packet */
                      post_office_send(response_mail, &err);
                    }
                    /*clear parray*/
                    memset(pArr,0,MAX_NUM_OF_SINGLE_PAGE_READ);
                    data_offset = 0;

                    while(get_usbd_tx_pending_status()) {
                      MCU_HAL_Delay(1);
                    }
                  }
               }
            }
         }

        // revert_fs_prio();
         timeout = ADI_OSAL_TIMEOUT_FOREVER;
         fs_stream_state = ADI_FS_STREAM_STOPPED;

        /* Flash power off */
        if(fs_flash_power_on(false) != FS_STATUS_OK) {
          NRF_LOG_INFO("Flash power off error");
        }
        break;
      }
#endif
       case M2M2_FILE_SYS_CMD_GET_FS_FORMAT_INFO_REQ: {
        m2m2_file_sys_format_debug_info_req_t *payload = (m2m2_file_sys_format_debug_info_req_t*)&pkt->data[0];
        response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_format_debug_info_resp_t));
        if(response_mail != NULL) {
          m2m2_file_sys_format_debug_info_resp_t *resp_payload = (m2m2_file_sys_format_debug_info_resp_t *)&response_mail->data[0];
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;    
#ifdef FORMAT_DEBUG_INFO_CMD
          get_fs_format_debug_info(resp_payload);
#else
          memset(resp_payload, 0, sizeof(m2m2_file_sys_format_debug_info_resp_t));/* debug info values set to 0, if macro not enabled */
#endif
          resp_payload->status = M2M2_FILE_SYS_STATUS_OK;
          resp_payload->command = M2M2_FILE_SYS_CMD_GET_FS_FORMAT_INFO_RESP;
          /* send response packet */
          post_office_send(response_mail, &err);
        }
        break;
       }
      case M2M2_FILE_SYS_CMD_STOP_LOGGING_REQ: {
        FS_STATUS_ENUM_t fs_error;
        uint8_t stream_in_progress = 0;

        if(FileSrc != M2M2_ADDR_UNDEFINED) {
#ifdef HIBERNATE_MD_EN
          hibernate_md_set(HIB_MD_FS_LOG_STOP_EVT);
          hibernate_mode_entry();
#endif
//#ifdef ENABLE_WATCH_DISPLAY
//          reset_display_vol_info();
//          //Update the NAND memory progress bar in Main menu page of Display
//          send_private_type_value(DIS_REFRESH_SIGNAL);
//#endif

          FileSrc = pkt->src;
          /* Backup stop source */
          m2m2_file_sys_stop_log_cmd_t *payload = (m2m2_file_sys_stop_log_cmd_t *)&pkt->data[0];
          if(StopSrc == M2M2_FILE_SYS_STOP_LOGGING_INVALID) {
            StopSrc = payload->stop_type;
          }
          /* Send stream stop request */
          if(fs_hal_write_access_state() == FS_FILE_ACCESS_IN_PROGRESS) {
            if(get_file_system_subs_count() == 0) {
              /* Stop File logging */
              fs_error = fs_hal_close_file(fs_hal_write_file_pointer());
#ifdef ENABLE_WATCH_DISPLAY
#ifdef LOW_TOUCH_FEATURE
              if(!get_low_touch_trigger_mode3_status())
#endif
                reset_display_vol_info();
#ifdef CUST4_SM
              else
                reset_display_vol_info1();
#endif
              //Update the NAND memory progress bar in Main menu page of Display
              send_private_type_value(DIS_REFRESH_SIGNAL);
#endif
              if(fs_error == FS_STATUS_OK) {
                /* Power off Flash */
                if(fs_flash_power_on(false) != FS_STATUS_OK) {
                NRF_LOG_INFO("Flash power off error");
                }
              }
            } else {
               stream_in_progress = 1;
            }

            /* Create response packet */
            response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_stop_log_cmd_t));
            if(response_mail != NULL) {
              m2m2_file_sys_stop_log_cmd_t *resp_payload = (m2m2_file_sys_stop_log_cmd_t *)&response_mail->data[0];
              response_mail->src = M2M2_ADDR_SYS_FS;
              response_mail->dest = FileSrc;

              /* stream in progress, file cannot be closed */
              if(stream_in_progress) {
                resp_payload->status = M2M2_APP_COMMON_STATUS_STREAM_IN_PROGRESS;
              } else {
                 if(fs_error == FS_STATUS_OK) {
                  if(StopSrc == M2M2_FILE_SYS_MEMORY_FULL) {
                    resp_payload->status = M2M2_FILE_SYS_ERR_MEMORY_FULL;
                    resp_payload->stop_type = M2M2_FILE_SYS_MEMORY_FULL;
                  } else if(StopSrc == M2M2_FILE_SYS_BATTERY_LOW) {
                    resp_payload->status = M2M2_FILE_SYS_ERR_BATTERY_LOW;
                    resp_payload->stop_type = M2M2_FILE_SYS_BATTERY_LOW;
                  } else if(StopSrc == M2M2_FILE_SYS_POWER_STATE_SHUTDOWN) {
                    resp_payload->status = M2M2_FILE_SYS_ERR_POWER_STATE_SHUTDOWN;
                    resp_payload->stop_type = M2M2_FILE_SYS_POWER_STATE_SHUTDOWN;
                  }
                  else {
                    resp_payload->stop_type = M2M2_FILE_SYS_STOP_LOGGING;
                    resp_payload->status = M2M2_FILE_SYS_STATUS_LOGGING_STOPPED;
                    /*clear flag for next cycle of append , by default this has to be disabled*/
                    file_append=false;
                  }
                  FileSrc = M2M2_ADDR_UNDEFINED;
                  g_userinfo.keyID = M2M2_DEFAULT_KEY_ID;
                } else {
                  resp_payload->status = M2M2_FILE_SYS_STATUS_ERROR;
                }
              }
              resp_payload->command = M2M2_FILE_SYS_CMD_STOP_LOGGING_RESP;
              StopSrc = M2M2_FILE_SYS_STOP_LOGGING_INVALID;
              /* send response packet */
              post_office_send(response_mail, &err);
            }
          }
        }
        else {
          /* Send error response */
          response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_stop_log_cmd_t));
          if(response_mail != NULL) {
            m2m2_file_sys_stop_log_cmd_t *resp_payload = (m2m2_file_sys_stop_log_cmd_t *)&response_mail->data[0];
            resp_payload->command = M2M2_FILE_SYS_CMD_STOP_LOGGING_RESP;
            response_mail->src = pkt->dest;
            response_mail->dest = pkt->src;
            resp_payload->status = M2M2_FILE_SYS_STATUS_LOGGING_NOT_STARTED;
            resp_payload->stop_type = M2M2_FILE_SYS_STOP_LOGGING_INVALID;
            /* send response packet */
            post_office_send(response_mail, &err);
          }
        }
         NRF_LOG_INFO("******* Time out count for whole session = %d ************",TimeOutCount);
          break;
      }
      case M2M2_SENSOR_COMMON_CMD_STREAM_DATA: {
        M2M2_ADDR_ENUM_t TempAdress;
        M2M2_APP_COMMON_STATUS_ENUM_t TempStatus;
        int16_t index;
        TempAdress = get_file_routing_table_entry(pkt->src);
        if (TempAdress != M2M2_ADDR_UNDEFINED) {
          index = get_file_misd_packet_table_index(pkt->src);
          _m2m2_app_data_stream_hdr_t *payload = (_m2m2_app_data_stream_hdr_t*)&pkt->data[0];
          if ((FileSrc != M2M2_ADDR_UNDEFINED) && (file_hdr_wr_progress != true)) {
            TempStatus = fs_hal_write_packet_stream(pkt);
            /* Increase total packet count */
            if(index != -1) {
              file_misd_packet_table[index].totalpacketcount++;
            }
            /* Check write packet response and send error respose if required */
            if ( TempStatus != M2M2_APP_COMMON_STATUS_OK) {
              response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
              if (response_mail != NULL) {
                if(TempStatus != (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_ERR_MEMORY_FULL) {
                  /* Stop logging into file */
                  fs_hal_close_file(fs_hal_write_file_pointer());
                  fs_hal_write_error_resp(response_mail,&FileSrc);
                  post_office_send(response_mail,&err);
                } else {
                  gMemoryFull = true;
                  _m2m2_app_common_cmd_t *stream_resp = (_m2m2_app_common_cmd_t *)&response_mail->data[0];
                  stream_resp->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_CMD_FORCE_STOP_LOG_REQ;
                  stream_resp->status = M2M2_APP_COMMON_STATUS_OK;
                  response_mail->src = M2M2_ADDR_SYS_FS;
                  response_mail->dest = M2M2_ADDR_SYS_FS;
                  post_office_send(response_mail, &err);
                }
              }
              if (index != -1) {
                file_misd_packet_table[index].missedpackets++;
              }
            }
            if (index != -1) {
              /* check with prev sequence number */
              if (payload->sequence_num == 0) {
                if(file_misd_packet_table[index].count != 0) {
                  file_misd_packet_table[index].missedpackets += (65535 - file_misd_packet_table[index].count);
                }
              } else {
                if((file_misd_packet_table[index].count + 1) != payload->sequence_num) {
                  /* Get missed packet count and update the debug info structure */
                  file_misd_packet_table[index].missedpackets += (payload->sequence_num - file_misd_packet_table[index].count);
                  file_misd_packet_table[index].totalpacketcount += (payload->sequence_num - file_misd_packet_table[index].count);
                }
              }
              file_misd_packet_table[index].count = payload->sequence_num;
            }
          }
        }
        break;
      }
      case M2M2_FILE_SYS_CMD_CHUNK_RETRANSMIT_REQ: {
        uint32_t nPageRollOver = 0;
        uint32_t nPageNumber = 0;
        uint32_t nNextPageNumber = 0;
        uint8_t nPageChunkNumber = 0;
        uint8_t nMaxchunkNumber = 0;
        uint32_t nfilesize = 0;
        response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_download_log_stream_t));
        if(response_mail != NULL) {
          response_mail->src  =  pkt->dest;
          response_mail->dest = pkt->src;
          m2m2_file_sys_download_log_stream_t *resp = (m2m2_file_sys_download_log_stream_t *)&response_mail->data[0];
          resp->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_CMD_CHUNK_RETRANSMIT_RESP;// to change
          resp->status = (M2M2_FILE_SYS_STATUS_ENUM_t) M2M2_FILE_SYS_STATUS_ERROR;
          resp->page_chunk_size =  0;
          resp->page_number = 0;
          resp->page_chunk_number = 0;
          if (fs_stream_state != ADI_FS_STREAM_STARTED) {
            if(fs_flash_power_on(true) != FS_STATUS_OK) {
              resp->status = (M2M2_FILE_SYS_STATUS_ENUM_t) M2M2_FILE_SYS_STATUS_ERROR;
            } else {
              m2m2_file_sys_page_chunk_retransmit_req_t *retransmit_req = (m2m2_file_sys_page_chunk_retransmit_req_t*)&pkt->data[0];
              snprintf(fs_stream.file_path, ((pkt->length - M2M2_HEADER_SZ - 1)) , \
                "%s", retransmit_req->file_name);
              memset(&retransmit_req->file_name, 0,
                     pkt->length - (M2M2_HEADER_SZ + \
                       sizeof(m2m2_file_sys_page_chunk_retransmit_req_t) - 1));
              /* calculating page number based on roll-over */
              fs_stream.fs_buffer_size = sizeof(fs_stream.file_buff);
              nPageRollOver = retransmit_req->page_roll_over * 65536;
              nPageNumber = retransmit_req->page_number + nPageRollOver;
              nPageChunkNumber = retransmit_req->page_chunk_number + 1;// Get absolute chunk number
              fs_stream.fs_err_status = fs_hal_read_pageoffset(fs_stream.file_path, &fs_stream.file_buff[0], &fs_stream.fs_buffer_size, &nfilesize,nPageNumber,&fs_stream.current_page_number,&nNextPageNumber);
              nMaxchunkNumber = fs_stream.fs_buffer_size/ sizeof(resp->page_chunk_bytes);
              if((retransmit_req->retransmit_type == M2M2_FILE_SYS_PAGE_CHUNK_LOST) && (fs_stream.fs_err_status == FS_STATUS_OK)){
               if(nPageChunkNumber == nMaxchunkNumber){
               //need to read next page and first chunk
                nPageChunkNumber = 1;
                fs_stream.fs_err_status = fs_hal_read_pageoffset(fs_stream.file_path, &fs_stream.file_buff[0], &fs_stream.fs_buffer_size, &nfilesize,nNextPageNumber,&fs_stream.current_page_number,&nNextPageNumber);
                nMaxchunkNumber = fs_stream.fs_buffer_size/ sizeof(resp->page_chunk_bytes);
               }else{
                 nPageChunkNumber++;
               }
              }
              if(fs_stream.fs_err_status == FS_STATUS_OK) {
                resp->status = M2M2_FILE_SYS_STATUS_OK;
                fs_stream.processed_data_len =  (nPageChunkNumber - 1) * sizeof(resp->page_chunk_bytes);
                fs_stream.data_chunk_len =  fs_stream.fs_buffer_size;
                if (fs_stream.data_chunk_len > sizeof(resp->page_chunk_bytes)) {
                  fs_stream.data_chunk_len = sizeof(resp->page_chunk_bytes);
                }
                memset(&resp->page_chunk_bytes[0], 0, MEMBER_SIZE(m2m2_file_sys_download_log_stream_t, page_chunk_bytes));
                memcpy(&resp->page_chunk_bytes[0], &fs_stream.file_buff[fs_stream.processed_data_len],fs_stream.data_chunk_len);
                if(nPageChunkNumber < nMaxchunkNumber) {
                  fs_stream.data_chunk_len =  sizeof(resp->page_chunk_bytes);
                }else if(nPageChunkNumber == nMaxchunkNumber) {
                  fs_stream.data_chunk_len  = fs_stream.fs_buffer_size - (sizeof(resp->page_chunk_bytes) * nMaxchunkNumber);
                  if(fs_stream.data_chunk_len == 0) {
                    fs_stream.data_chunk_len = sizeof(resp->page_chunk_bytes);
                  }
                }else{
                  fs_stream.data_chunk_len = 0;
                  resp->status = M2M2_FILE_SYS_STATUS_ERROR;
                }
                if(resp->status != M2M2_FILE_SYS_STATUS_ERROR){
                resp->page_chunk_size =  fs_stream.data_chunk_len;
                resp->page_number = fs_stream.current_page_number % 65536;
                resp->page_chunk_number = nPageChunkNumber - 1;
                }
                response_mail->checksum =  0;
                resp->crc16 = crc16_compute((uint8_t *)response_mail,CRC_COMPUTE_LENGTH(fs_stream.data_chunk_len),NULL);
              } else {
                 fs_stream.data_chunk_len = 0;
                resp->status = M2M2_FILE_SYS_STATUS_ERROR;
              }
            }
          }
          post_office_send(response_mail, &err);
          if(fs_flash_power_on(false) != FS_STATUS_OK) {
	     NRF_LOG_INFO("Error flash power off");
          }
        }
        break;
      }
      case M2M2_FILE_SYS_CMD_SET_KEY_VALUE_PAIR_REQ: {
        m_time_struct *local_get_date_time;
        time_t return_time;
        int16_t timezone_offset;

        m2m2_file_sys_set_key_value_pair_req_t *payload = (m2m2_file_sys_set_key_value_pair_req_t*)&pkt->data[0];
        response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
        if(response_mail != NULL) {
          _m2m2_app_common_cmd_t *resp_payload = (_m2m2_app_common_cmd_t *)&response_mail->data[0];
          resp_payload->command = (M2M2_FILE_SYS_CMD_ENUM_t) M2M2_FILE_SYS_CMD_SET_KEY_VALUE_PAIR_RESP;
          get_log_time_stamp(&return_time, &timezone_offset);
          local_get_date_time = m_sec_to_date_time(return_time + timezone_offset);//For file getDateTime timezone_offset IS required
          memcpy(&g_userinfo.valueID[0], (void *)&payload->valueID[0],sizeof(g_userinfo.valueID));
          g_userinfo.keyID = M2M2_KEY_ID;
          g_userinfo.year = local_get_date_time->tm_year;
          g_userinfo.month = local_get_date_time->tm_mon;
          g_userinfo.day = local_get_date_time->tm_mday;
          g_userinfo.hour = local_get_date_time->tm_hour;
          g_userinfo.minute = local_get_date_time->tm_min;
          g_userinfo.second = local_get_date_time->tm_sec;
          g_userinfo.TZ_sec = timezone_offset;
          resp_payload->status = (M2M2_FILE_SYS_STATUS_ENUM_t) M2M2_FILE_SYS_STATUS_OK;
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          post_office_send(response_mail, &err);
         }
          break;
        }
      }
    } else {
      M2M2_APP_COMMON_STATUS_ENUM_t TempStatus;
      int16_t index;
      FS_STATUS_ENUM_t fs_error;
        index = get_file_misd_packet_table_index(pkt->src);
        _m2m2_app_data_stream_hdr_t *payload = (_m2m2_app_data_stream_hdr_t*)&pkt->data[0];
#ifdef NAND_WRITE_TEST
          uint32_t nTick = 0;
          nTick = MCU_HAL_GetTick();
#endif
         if ((FileSrc != M2M2_ADDR_UNDEFINED) && (file_hdr_wr_progress != true)) {
#ifdef ENABLE_DEBUG_STREAM
          // Debug stream will capture ADPD TS info , to save space in NAND flash avoid saving ADPD stream
          if(pkt->src != M2M2_ADDR_SENSOR_ADPD_STREAM6){ 
#endif
            TempStatus = fs_hal_write_packet_stream(pkt);
#ifdef ENABLE_DEBUG_STREAM
          }else{
            TempStatus = M2M2_APP_COMMON_STATUS_OK;
          }
#endif
          /* Increase total packet count */
          if(index != -1) {
            file_misd_packet_table[index].totalpacketcount++;
          }
#ifdef NAND_WRITE_TEST
          g_write_time = MCU_HAL_GetTick() - nTick;
          g_file_write_time += g_write_time;
         /* NRF_LOG_INFO("Packet write time = %d",g_write_time); */
#endif
          /* Check write packet response and send error respose if required */
          if (TempStatus != M2M2_APP_COMMON_STATUS_OK) {
            if(TempStatus != (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_ERR_MEMORY_FULL) {
              /* Stop logging into file */
              fs_hal_close_file(fs_hal_write_file_pointer());
              /* Send Error response if write to Flash fails */
              fs_send_write_error(&FileSrc);
            } else {
                /* unsubscribe streams */
                fs_unsubscribe_streams();

                /* Power off Flash */
                if(fs_flash_power_on(false) != FS_STATUS_OK) {
                  NRF_LOG_INFO("Flash power off error");
                }

                /* send message to source */
                response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_stop_log_cmd_t));
                if(response_mail != NULL) {
                    m2m2_file_sys_stop_log_cmd_t *resp_payload = (m2m2_file_sys_stop_log_cmd_t *)&response_mail->data[0];
                    response_mail->src = M2M2_ADDR_SYS_FS;
                    response_mail->dest = FileSrc;
                    resp_payload->status = M2M2_FILE_SYS_ERR_MEMORY_FULL;
                    resp_payload->command = M2M2_FILE_SYS_CMD_STOP_LOGGING_RESP;
                    StopSrc = M2M2_FILE_SYS_STOP_LOGGING_INVALID;
                    /* send response packet */
                    post_office_send(response_mail, &err);
                  }
                  FileSrc = M2M2_ADDR_UNDEFINED;
                }

