ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/file_system_task.c
            if (index != -1) {
              file_misd_packet_table[index].missedpackets++;
            }
          }
          /* Update FS missed packet and total packet info */
          if (index != -1) {
            /* check with prev sequence number */
            if (payload->sequence_num == 0) {
              if(file_misd_packet_table[index].count != 0) {
                file_misd_packet_table[index].missedpackets += (65535 - file_misd_packet_table[index].count);
              }
            } else {
              if((file_misd_packet_table[index].count + 1) != payload->sequence_num) {
                /* Get missed packet count and update the debug info structure */
                file_misd_packet_table[index].missedpackets += (payload->sequence_num - file_misd_packet_table[index].count);
                file_misd_packet_table[index].totalpacketcount += (payload->sequence_num - file_misd_packet_table[index].count);
              }
            }
            file_misd_packet_table[index].count = payload->sequence_num;
          }
        }
    }
      gFileSystemMsgProcessCnt++;
      post_office_consume_msg(pkt);
    }
    if(fs_stream_state == ADI_FS_STREAM_STARTED) {
      hike_fs_prio();
      if((fs_stream.fs_err_status != FS_STATUS_ERR_EOF) || (fs_stream_final_buffer == 1)) {
        do {
          fs_stream.data_chunk_len = fs_stream.fs_buffer_size - fs_stream.processed_data_len;
          /* Give the system some time to clear out pending messages */
          response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_download_log_stream_t));
          while (response_mail == NULL) {
            MCU_HAL_Delay(50);
            response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_download_log_stream_t));
          }
          /* to compute CRC with stream as source and destination as application */
          response_mail->src  =  M2M2_ADDR_SYS_FS_STREAM;
          response_mail->dest =  fs_stream.pkt_src;
          m2m2_file_sys_download_log_stream_t *resp = (m2m2_file_sys_download_log_stream_t *)&response_mail->data[0];
          resp->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_CMD_DOWNLOAD_LOG_RESP;
          if (fs_stream.fs_buffer_size <= sizeof(fs_stream.file_buff)) {
            resp->status = M2M2_FILE_SYS_STATUS_OK;
          }
          if (fs_stream.data_chunk_len > sizeof(resp->page_chunk_bytes)) {
            fs_stream.data_chunk_len = sizeof(resp->page_chunk_bytes);
          }
          memcpy(&resp->page_chunk_bytes[0], &fs_stream.file_buff[fs_stream.processed_data_len], fs_stream.data_chunk_len);
          fs_stream.num_bytes_left -= fs_stream.data_chunk_len;
          fs_stream.processed_data_len += fs_stream.data_chunk_len;
          num_bytes_processed += fs_stream.processed_data_len;
          resp->page_chunk_size = fs_stream.data_chunk_len;
          if (fs_stream.fs_err_status == FS_STATUS_ERR_EOF && fs_stream.num_bytes_left == 0) {
            resp->status = (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_END_OF_FILE;
            response_mail->checksum =  nSeqNum;
            fs_stream.page_chunk_number %= MAX_PAGE_CHUNK_COUNT;
            resp->page_chunk_number = fs_stream.page_chunk_number;
            fs_stream.page_chunk_number++;
            resp->page_number = fs_get_file_page_number_offset(&fs_stream.current_page_number,&fs_stream.file_start_page_number,true);
            /* crc calculation */
            resp->crc16 = crc16_compute((uint8_t *)response_mail,CRC_COMPUTE_LENGTH(fs_stream.data_chunk_len),NULL);
            response_mail->src = M2M2_ADDR_SYS_FS;
            response_mail->dest = M2M2_ADDR_SYS_FS_STREAM;// FS STREAM
            setFsDownloadFlag(1);
            fs_download_chunk_cnt++;
            fs_download_total_pkt_cnt++;
            post_office_send(response_mail, &err);
            /* Unsubscribe from mailbox */
            fs_stream_usubscribe();
            fs_stream.pkt_src = M2M2_ADDR_UNDEFINED;
            fs_stream.pkt_dest = M2M2_ADDR_UNDEFINED;
            fs_stream_state = ADI_FS_STREAM_STOPPED;
            timeout = ADI_OSAL_TIMEOUT_FOREVER;
            revert_fs_prio();
#ifdef CUST4_SM
            if(get_user0_config_app_state() == STATE_END_MONITORING)
            {
              //Register event received
              set_user0_config_app_event(EVENT_FINISH_LOG_TRANSFER);
            }
#endif
#ifdef PROFILE_TIME_ENABLED
          /* avg cal*/
          usb_avg_tx_time = usb_avg_tx_time / num_bytes_transferred;
          usb_avg_cdc_write_time = usb_avg_cdc_write_time / num_bytes_transferred;
          /* page size */
          avg_file_read_time = avg_file_read_time / num_times_read;
          /* 4 milli sec delay = 4000 micro sec */
          delay_time = max_num_of_retries*4000;
          total_time_taken_512_bytes_transfer = avg_file_read_time+delay_time + usb_avg_tx_time+usb_avg_cdc_write_time;
#endif
            break;
          }
          if ( fs_stream.fs_err_status == FS_STATUS_OK) {
            resp->page_chunk_size = fs_stream.data_chunk_len;
            resp->status = M2M2_FILE_SYS_STATUS_OK;
          } else if (fs_stream.fs_err_status == FS_STATUS_ERR_STDIO) {
            resp->page_chunk_size = 0;
            resp->status = (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_FILE_SYS_ERR_INVALID;
          }
          response_mail->checksum =  nSeqNum;
          fs_stream.page_chunk_number %= MAX_PAGE_CHUNK_COUNT;
          resp->page_chunk_number = fs_stream.page_chunk_number;
          fs_stream.page_chunk_number++;
          resp->page_number = fs_get_file_page_number_offset(&fs_stream.current_page_number,&fs_stream.file_start_page_number,true);
          resp->crc16 = crc16_compute((uint8_t *)response_mail,CRC_COMPUTE_LENGTH(fs_stream.data_chunk_len),NULL);
          response_mail->src = M2M2_ADDR_SYS_FS;
          response_mail->dest = M2M2_ADDR_SYS_FS_STREAM;
          setFsDownloadFlag(1);
          fs_download_chunk_cnt++;
          fs_download_total_pkt_cnt++;
          post_office_send(response_mail, &err);
          nSeqNum++;
          n500bChunkCnt++;
        } while (fs_stream.processed_data_len < fs_stream.fs_buffer_size);
        fs_stream.page_chunk_number = 0;
        /* Power Off Nand if final buffer is transmitted */
        if(fs_stream_final_buffer == 1) {
          /* Power off Flash */
          if(fs_flash_power_on(false) != FS_STATUS_OK){
            NRF_LOG_INFO("flash power off error");
          }
        }
        fs_stream_final_buffer = 0;
        fs_stream.processed_data_len = 0;

