ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/file_system_task.c
        if(fs_stream.fs_err_status != FS_STATUS_ERR_EOF) {
#ifdef NAND_READ_TEST
          uint32_t nTick = 0;
          static uint8_t index = 0;

          nTick = MCU_HAL_GetTick();
#endif /* NAND_READ_TEST */
          fs_stream.fs_buffer_size = sizeof(fs_stream.file_buff);
          fs_stream.fs_err_status = fs_hal_read_file(fs_stream.file_path, &fs_stream.file_buff[0], &fs_stream.fs_buffer_size, &fs_stream.current_page_number);
          fs_status_stored = fs_stream.fs_err_status;
#ifdef NAND_READ_TEST
          g_read_time = MCU_HAL_GetTick() - nTick;
          g_file_read_time += g_read_time;
          g_file_read_cnt++;
          if(index == 14)
            index =0;
          else
            index++;
#endif /* NAND_READ_TEST */

          /* Check Error status */
          if(fs_stream.fs_err_status == FS_STATUS_ERR_EOF) {
            fs_stream_final_buffer = 1;
          } else if(fs_stream.fs_err_status != FS_STATUS_OK) {
             response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_download_log_stream_t));
             if(response_mail != NULL) {
               response_mail->src = M2M2_ADDR_SYS_FS;
               response_mail->dest = M2M2_ADDR_SYS_FS_STREAM;
               m2m2_file_sys_download_log_stream_t *resp_payload = (m2m2_file_sys_download_log_stream_t *)&response_mail->data[0];
               resp_payload->page_chunk_size = 0;
               resp_payload->status = M2M2_FILE_SYS_STATUS_ERROR;
               /* Send Error response to App */
               post_office_send(response_mail, &err);
               /* Unsubscribe from mailbox */
               fs_stream_usubscribe();
               /* Stop streaming file */
               fs_stream.pkt_src = M2M2_ADDR_UNDEFINED;
               fs_stream.pkt_dest = M2M2_ADDR_UNDEFINED;
               fs_stream_state = ADI_FS_STREAM_STOPPED;
               timeout = ADI_OSAL_TIMEOUT_FOREVER;
               revert_fs_prio();
             }
            }
        }
        /* wait for packet transfer only if DOWNLOAD_LOG requested by external tool */
        if(gsFsDownloadReqByExtTool)
        {
          while(get_file_download_chunk_count() < fs_download_chunk_cnt)
          {
            MCU_HAL_Delay(4);
          }
          while(get_usbd_tx_pending_status())
          {
            MCU_HAL_Delay(1);
          }
        }
        setFsDownloadFlag(0);
        fs_download_chunk_cnt = 0;
        if(fs_stream.fs_err_status == FS_STATUS_ERR_EOF) {
          fs_stream_final_buffer = 1;
        }
        fs_stream.num_bytes_left = fs_stream.fs_buffer_size;
      }
    }
    /* reset the variable everytime after completing the download request */
    gsFsDownloadReqByExtTool = 0;
  }
}

/*!
  ****************************************************************************
* @brief  Send Write error resp
* @param  src: the stream to send error to
* @return None
*****************************************************************************/
void fs_send_write_error(M2M2_ADDR_ENUM_t *src) {
  m2m2_hdr_t                    *response_mail = NULL;
  ADI_OSAL_STATUS               err;
  response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_cmd_t));
  if(response_mail != NULL) {
    m2m2_file_sys_cmd_t *resp_payload = (m2m2_file_sys_cmd_t *)&response_mail->data[0];
    resp_payload->command = M2M2_FILE_SYS_CMD_START_LOGGING_RESP;
    response_mail->src = M2M2_ADDR_SYS_FS;
    response_mail->dest = *src;
    resp_payload->status = M2M2_FILE_SYS_STATUS_LOGGING_ERROR;
    *src = M2M2_ADDR_UNDEFINED;
    /* send response packet */
    post_office_send(response_mail, &err);
  }
}

/*!
  ****************************************************************************
* @brief  Unsubscribe fs stream
* @param  None
* @return None
*****************************************************************************/
void fs_stream_usubscribe() {
  ADI_OSAL_STATUS err;
  /* Unsubscribe from mailbox */
  if(FileStreamSubsciberCount!=0){
    FileStreamSubsciberCount--;
    m2m2_hdr_t *sub_pkt = post_office_create_msg(M2M2_HEADER_SZ + sizeof(post_office_config_t));
    if(sub_pkt != NULL) {
      post_office_config_t *payload = (post_office_config_t *)&sub_pkt->data;
      payload->cmd = POST_OFFICE_CFG_CMD_MAILBOX_UNSUBSCRIBE;
      payload->sub = fs_stream.pkt_src;
      payload->box = M2M2_ADDR_SYS_FS_STREAM;
      sub_pkt->src = fs_stream.pkt_dest;
      sub_pkt->dest = M2M2_ADDR_POST_OFFICE;
      post_office_send(sub_pkt, &err);
    }
  }
}
#endif /* USE_FS */
/*@}*/  /* end of group file_system_task */
/**@}*/ /* end of group Tasks */
/*/ /* end of group Tasks */